MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile RXF14EIDLbits_t RXF14EIDLbits __at(0xE6B);
// bitfield macros
#define _RXF14EIDL_EID_POSN                                 0x0
#define _RXF14EIDL_EID_POSITION                             0x0
#define _RXF14EIDL_EID_SIZE                                 0x8
#define _RXF14EIDL_EID_LENGTH                               0x8
#define _RXF14EIDL_EID_MASK                                 0xFF
#define _RXF14EIDL_EID0_POSN                                0x0
#define _RXF14EIDL_EID0_POSITION                            0x0
#define _RXF14EIDL_EID0_SIZE                                0x1
#define _RXF14EIDL_EID0_LENGTH                              0x1
#define _RXF14EIDL_EID0_MASK                                0x1
#define _RXF14EIDL_EID1_POSN                                0x1
#define _RXF14EIDL_EID1_POSITION                            0x1
#define _RXF14EIDL_EID1_SIZE                                0x1
#define _RXF14EIDL_EID1_LENGTH                              0x1
#define _RXF14EIDL_EID1_MASK                                0x2
#define _RXF14EIDL_EID2_POSN                                0x2
#define _RXF14EIDL_EID2_POSITION                            0x2
#define _RXF14EIDL_EID2_SIZE                                0x1
#define _RXF14EIDL_EID2_LENGTH                              0x1
#define _RXF14EIDL_EID2_MASK                                0x4
#define _RXF14EIDL_EID3_POSN                                0x3
#define _RXF14EIDL_EID3_POSITION                            0x3
#define _RXF14EIDL_EID3_SIZE                                0x1
#define _RXF14EIDL_EID3_LENGTH                              0x1
#define _RXF14EIDL_EID3_MASK                                0x8
#define _RXF14EIDL_EID4_POSN                                0x4
#define _RXF14EIDL_EID4_POSITION                            0x4
#define _RXF14EIDL_EID4_SIZE                                0x1
#define _RXF14EIDL_EID4_LENGTH                              0x1
#define _RXF14EIDL_EID4_MASK                                0x10
#define _RXF14EIDL_EID5_POSN                                0x5
#define _RXF14EIDL_EID5_POSITION                            0x5
#define _RXF14EIDL_EID5_SIZE                                0x1
#define _RXF14EIDL_EID5_LENGTH                              0x1
#define _RXF14EIDL_EID5_MASK                                0x20
#define _RXF14EIDL_EID6_POSN                                0x6
#define _RXF14EIDL_EID6_POSITION                            0x6
#define _RXF14EIDL_EID6_SIZE                                0x1
#define _RXF14EIDL_EID6_LENGTH                              0x1
#define _RXF14EIDL_EID6_MASK                                0x40
#define _RXF14EIDL_EID7_POSN                                0x7
#define _RXF14EIDL_EID7_POSITION                            0x7
#define _RXF14EIDL_EID7_SIZE                                0x1
#define _RXF14EIDL_EID7_LENGTH                              0x1
#define _RXF14EIDL_EID7_MASK                                0x80
#define _RXF14EIDL_RXF14EID0_POSN                           0x0
#define _RXF14EIDL_RXF14EID0_POSITION                       0x0
#define _RXF14EIDL_RXF14EID0_SIZE                           0x1
#define _RXF14EIDL_RXF14EID0_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID0_MASK                           0x1
#define _RXF14EIDL_RXF14EID1_POSN                           0x1
#define _RXF14EIDL_RXF14EID1_POSITION                       0x1
#define _RXF14EIDL_RXF14EID1_SIZE                           0x1
#define _RXF14EIDL_RXF14EID1_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID1_MASK                           0x2
#define _RXF14EIDL_RXF14EID2_POSN                           0x2
#define _RXF14EIDL_RXF14EID2_POSITION                       0x2
#define _RXF14EIDL_RXF14EID2_SIZE                           0x1
#define _RXF14EIDL_RXF14EID2_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID2_MASK                           0x4
#define _RXF14EIDL_RXF14EID3_POSN                           0x3
#define _RXF14EIDL_RXF14EID3_POSITION                       0x3
#define _RXF14EIDL_RXF14EID3_SIZE                           0x1
#define _RXF14EIDL_RXF14EID3_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID3_MASK                           0x8
#define _RXF14EIDL_RXF14EID4_POSN                           0x4
#define _RXF14EIDL_RXF14EID4_POSITION                       0x4
#define _RXF14EIDL_RXF14EID4_SIZE                           0x1
#define _RXF14EIDL_RXF14EID4_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID4_MASK                           0x10
#define _RXF14EIDL_RXF14EID5_POSN                           0x5
#define _RXF14EIDL_RXF14EID5_POSITION                       0x5
#define _RXF14EIDL_RXF14EID5_SIZE                           0x1
#define _RXF14EIDL_RXF14EID5_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID5_MASK                           0x20
#define _RXF14EIDL_RXF14EID6_POSN                           0x6
#define _RXF14EIDL_RXF14EID6_POSITION                       0x6
#define _RXF14EIDL_RXF14EID6_SIZE                           0x1
#define _RXF14EIDL_RXF14EID6_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID6_MASK                           0x40
#define _RXF14EIDL_RXF14EID7_POSN                           0x7
#define _RXF14EIDL_RXF14EID7_POSITION                       0x7
#define _RXF14EIDL_RXF14EID7_SIZE                           0x1
#define _RXF14EIDL_RXF14EID7_LENGTH                         0x1
#define _RXF14EIDL_RXF14EID7_MASK                           0x80

// Register: RXF15SIDH
#define RXF15SIDH RXF15SIDH
extern volatile unsigned char           RXF15SIDH           __at(0xE6C);
#ifndef _LIB_BUILD
asm("RXF15SIDH equ 0E6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF15SID3              :1;
        unsigned RXF15SID4              :1;
        unsigned RXF15SID5              :1;
        unsigned RXF15SID6              :1;
        unsigned RXF15SID7              :1;
        unsigned RXF15SID8              :1;
        unsigned RXF15SID9              :1;
        unsigned RXF15SID10             :1;
    };
} RXF15SIDHbits_t;
extern volatile RXF15SIDHbits_t RXF15SIDHbits __at(0xE6C);
// bitfield macros
#define _RXF15SIDH_SID_POSN                                 0x0
#define _RXF15SIDH_SID_POSITION                             0x0
#define _RXF15SIDH_SID_SIZE                                 0x8
#define _RXF15SIDH_SID_LENGTH                               0x8
#define _RXF15SIDH_SID_MASK                                 0xFF
#define _RXF15SIDH_SID3_POSN                                0x0
#define _RXF15SIDH_SID3_POSITION                            0x0
#define _RXF15SIDH_SID3_SIZE                                0x1
#define _RXF15SIDH_SID3_LENGTH                              0x1
#define _RXF15SIDH_SID3_MASK                                0x1
#define _RXF15SIDH_SID4_POSN                                0x1
#define _RXF15SIDH_SID4_POSITION                            0x1
#define _RXF15SIDH_SID4_SIZE                                0x1
#define _RXF15SIDH_SID4_LENGTH                              0x1
#define _RXF15SIDH_SID4_MASK                                0x2
#define _RXF15SIDH_SID5_POSN                                0x2
#define _RXF15SIDH_SID5_POSITION                            0x2
#define _RXF15SIDH_SID5_SIZE                                0x1
#define _RXF15SIDH_SID5_LENGTH                              0x1
#define _RXF15SIDH_SID5_MASK                                0x4
#define _RXF15SIDH_SID6_POSN                                0x3
#define _RXF15SIDH_SID6_POSITION                            0x3
#define _RXF15SIDH_SID6_SIZE                                0x1
#define _RXF15SIDH_SID6_LENGTH                              0x1
#define _RXF15SIDH_SID6_MASK                                0x8
#define _RXF15SIDH_SID7_POSN                                0x4
#define _RXF15SIDH_SID7_POSITION                            0x4
#define _RXF15SIDH_SID7_SIZE                                0x1
#define _RXF15SIDH_SID7_LENGTH                              0x1
#define _RXF15SIDH_SID7_MASK                                0x10
#define _RXF15SIDH_SID8_POSN                                0x5
#define _RXF15SIDH_SID8_POSITION                            0x5
#define _RXF15SIDH_SID8_SIZE                                0x1
#define _RXF15SIDH_SID8_LENGTH                              0x1
#define _RXF15SIDH_SID8_MASK                                0x20
#define _RXF15SIDH_SID9_POSN                                0x6
#define _RXF15SIDH_SID9_POSITION                            0x6
#define _RXF15SIDH_SID9_SIZE                                0x1
#define _RXF15SIDH_SID9_LENGTH                              0x1
#define _RXF15SIDH_SID9_MASK                                0x40
#define _RXF15SIDH_SID10_POSN                               0x7
#define _RXF15SIDH_SID10_POSITION                           0x7
#define _RXF15SIDH_SID10_SIZE                               0x1
#define _RXF15SIDH_SID10_LENGTH                             0x1
#define _RXF15SIDH_SID10_MASK                               0x80
#define _RXF15SIDH_RXF15SID3_POSN                           0x0
#define _RXF15SIDH_RXF15SID3_POSITION                       0x0
#define _RXF15SIDH_RXF15SID3_SIZE                           0x1
#define _RXF15SIDH_RXF15SID3_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID3_MASK                           0x1
#define _RXF15SIDH_RXF15SID4_POSN                           0x1
#define _RXF15SIDH_RXF15SID4_POSITION                       0x1
#define _RXF15SIDH_RXF15SID4_SIZE                           0x1
#define _RXF15SIDH_RXF15SID4_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID4_MASK                           0x2
#define _RXF15SIDH_RXF15SID5_POSN                           0x2
#define _RXF15SIDH_RXF15SID5_POSITION                       0x2
#define _RXF15SIDH_RXF15SID5_SIZE                           0x1
#define _RXF15SIDH_RXF15SID5_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID5_MASK                           0x4
#define _RXF15SIDH_RXF15SID6_POSN                           0x3
#define _RXF15SIDH_RXF15SID6_POSITION                       0x3
#define _RXF15SIDH_RXF15SID6_SIZE                           0x1
#define _RXF15SIDH_RXF15SID6_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID6_MASK                           0x8
#define _RXF15SIDH_RXF15SID7_POSN                           0x4
#define _RXF15SIDH_RXF15SID7_POSITION                       0x4
#define _RXF15SIDH_RXF15SID7_SIZE                           0x1
#define _RXF15SIDH_RXF15SID7_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID7_MASK                           0x10
#define _RXF15SIDH_RXF15SID8_POSN                           0x5
#define _RXF15SIDH_RXF15SID8_POSITION                       0x5
#define _RXF15SIDH_RXF15SID8_SIZE                           0x1
#define _RXF15SIDH_RXF15SID8_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID8_MASK                           0x20
#define _RXF15SIDH_RXF15SID9_POSN                           0x6
#define _RXF15SIDH_RXF15SID9_POSITION                       0x6
#define _RXF15SIDH_RXF15SID9_SIZE                           0x1
#define _RXF15SIDH_RXF15SID9_LENGTH                         0x1
#define _RXF15SIDH_RXF15SID9_MASK                           0x40
#define _RXF15SIDH_RXF15SID10_POSN                          0x7
#define _RXF15SIDH_RXF15SID10_POSITION                      0x7
#define _RXF15SIDH_RXF15SID10_SIZE                          0x1
#define _RXF15SIDH_RXF15SID10_LENGTH                        0x1
#define _RXF15SIDH_RXF15SID10_MASK                          0x80

