MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
// Register: RXF15SIDL
#define RXF15SIDL RXF15SIDL
extern volatile unsigned char           RXF15SIDL           __at(0xE6D);
#ifndef _LIB_BUILD
asm("RXF15SIDL equ 0E6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF15EID16             :1;
        unsigned RXF15EID17             :1;
        unsigned                        :1;
        unsigned RXF15EXIDEN            :1;
        unsigned                        :1;
        unsigned RXF15SID0              :1;
        unsigned RXF15SID1              :1;
        unsigned RXF15SID2              :1;
    };
} RXF15SIDLbits_t;
extern volatile RXF15SIDLbits_t RXF15SIDLbits __at(0xE6D);
// bitfield macros
#define _RXF15SIDL_EID_POSN                                 0x0
#define _RXF15SIDL_EID_POSITION                             0x0
#define _RXF15SIDL_EID_SIZE                                 0x2
#define _RXF15SIDL_EID_LENGTH                               0x2
#define _RXF15SIDL_EID_MASK                                 0x3
#define _RXF15SIDL_EXIDEN_POSN                              0x3
#define _RXF15SIDL_EXIDEN_POSITION                          0x3
#define _RXF15SIDL_EXIDEN_SIZE                              0x1
#define _RXF15SIDL_EXIDEN_LENGTH                            0x1
#define _RXF15SIDL_EXIDEN_MASK                              0x8
#define _RXF15SIDL_SID_POSN                                 0x5
#define _RXF15SIDL_SID_POSITION                             0x5
#define _RXF15SIDL_SID_SIZE                                 0x3
#define _RXF15SIDL_SID_LENGTH                               0x3
#define _RXF15SIDL_SID_MASK                                 0xE0
#define _RXF15SIDL_EID16_POSN                               0x0
#define _RXF15SIDL_EID16_POSITION                           0x0
#define _RXF15SIDL_EID16_SIZE                               0x1
#define _RXF15SIDL_EID16_LENGTH                             0x1
#define _RXF15SIDL_EID16_MASK                               0x1
#define _RXF15SIDL_EID17_POSN                               0x1
#define _RXF15SIDL_EID17_POSITION                           0x1
#define _RXF15SIDL_EID17_SIZE                               0x1
#define _RXF15SIDL_EID17_LENGTH                             0x1
#define _RXF15SIDL_EID17_MASK                               0x2
#define _RXF15SIDL_SID0_POSN                                0x5
#define _RXF15SIDL_SID0_POSITION                            0x5
#define _RXF15SIDL_SID0_SIZE                                0x1
#define _RXF15SIDL_SID0_LENGTH                              0x1
#define _RXF15SIDL_SID0_MASK                                0x20
#define _RXF15SIDL_SID1_POSN                                0x6
#define _RXF15SIDL_SID1_POSITION                            0x6
#define _RXF15SIDL_SID1_SIZE                                0x1
#define _RXF15SIDL_SID1_LENGTH                              0x1
#define _RXF15SIDL_SID1_MASK                                0x40
#define _RXF15SIDL_SID2_POSN                                0x7
#define _RXF15SIDL_SID2_POSITION                            0x7
#define _RXF15SIDL_SID2_SIZE                                0x1
#define _RXF15SIDL_SID2_LENGTH                              0x1
#define _RXF15SIDL_SID2_MASK                                0x80
#define _RXF15SIDL_RXF15EID16_POSN                          0x0
#define _RXF15SIDL_RXF15EID16_POSITION                      0x0
#define _RXF15SIDL_RXF15EID16_SIZE                          0x1
#define _RXF15SIDL_RXF15EID16_LENGTH                        0x1
#define _RXF15SIDL_RXF15EID16_MASK                          0x1
#define _RXF15SIDL_RXF15EID17_POSN                          0x1
#define _RXF15SIDL_RXF15EID17_POSITION                      0x1
#define _RXF15SIDL_RXF15EID17_SIZE                          0x1
#define _RXF15SIDL_RXF15EID17_LENGTH                        0x1
#define _RXF15SIDL_RXF15EID17_MASK                          0x2
#define _RXF15SIDL_RXF15EXIDEN_POSN                         0x3
#define _RXF15SIDL_RXF15EXIDEN_POSITION                     0x3
#define _RXF15SIDL_RXF15EXIDEN_SIZE                         0x1
#define _RXF15SIDL_RXF15EXIDEN_LENGTH                       0x1
#define _RXF15SIDL_RXF15EXIDEN_MASK                         0x8
#define _RXF15SIDL_RXF15SID0_POSN                           0x5
#define _RXF15SIDL_RXF15SID0_POSITION                       0x5
#define _RXF15SIDL_RXF15SID0_SIZE                           0x1
#define _RXF15SIDL_RXF15SID0_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID0_MASK                           0x20
#define _RXF15SIDL_RXF15SID1_POSN                           0x6
#define _RXF15SIDL_RXF15SID1_POSITION                       0x6
#define _RXF15SIDL_RXF15SID1_SIZE                           0x1
#define _RXF15SIDL_RXF15SID1_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID1_MASK                           0x40
#define _RXF15SIDL_RXF15SID2_POSN                           0x7
#define _RXF15SIDL_RXF15SID2_POSITION                       0x7
#define _RXF15SIDL_RXF15SID2_SIZE                           0x1
#define _RXF15SIDL_RXF15SID2_LENGTH                         0x1
#define _RXF15SIDL_RXF15SID2_MASK                           0x80

// Register: RXF15EIDH
#define RXF15EIDH RXF15EIDH
extern volatile unsigned char           RXF15EIDH           __at(0xE6E);
#ifndef _LIB_BUILD
asm("RXF15EIDH equ 0E6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXFEID                 :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF15EID8              :1;
        unsigned RXF15EID9              :1;
        unsigned RXF15EID10             :1;
        unsigned RXF15EID11             :1;
        unsigned RXF15EID12             :1;
        unsigned RXF15EID13             :1;
        unsigned RXF15EID14             :1;
        unsigned RXF15EID15             :1;
    };
} RXF15EIDHbits_t;
