MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile B2SIDHbits_t B2SIDHbits __at(0xEA1);
// bitfield macros
#define _B2SIDH_SID_POSN                                    0x0
#define _B2SIDH_SID_POSITION                                0x0
#define _B2SIDH_SID_SIZE                                    0x8
#define _B2SIDH_SID_LENGTH                                  0x8
#define _B2SIDH_SID_MASK                                    0xFF
#define _B2SIDH_SID3_POSN                                   0x0
#define _B2SIDH_SID3_POSITION                               0x0
#define _B2SIDH_SID3_SIZE                                   0x1
#define _B2SIDH_SID3_LENGTH                                 0x1
#define _B2SIDH_SID3_MASK                                   0x1
#define _B2SIDH_SID4_POSN                                   0x1
#define _B2SIDH_SID4_POSITION                               0x1
#define _B2SIDH_SID4_SIZE                                   0x1
#define _B2SIDH_SID4_LENGTH                                 0x1
#define _B2SIDH_SID4_MASK                                   0x2
#define _B2SIDH_SID5_POSN                                   0x2
#define _B2SIDH_SID5_POSITION                               0x2
#define _B2SIDH_SID5_SIZE                                   0x1
#define _B2SIDH_SID5_LENGTH                                 0x1
#define _B2SIDH_SID5_MASK                                   0x4
#define _B2SIDH_SID6_POSN                                   0x3
#define _B2SIDH_SID6_POSITION                               0x3
#define _B2SIDH_SID6_SIZE                                   0x1
#define _B2SIDH_SID6_LENGTH                                 0x1
#define _B2SIDH_SID6_MASK                                   0x8
#define _B2SIDH_SID7_POSN                                   0x4
#define _B2SIDH_SID7_POSITION                               0x4
#define _B2SIDH_SID7_SIZE                                   0x1
#define _B2SIDH_SID7_LENGTH                                 0x1
#define _B2SIDH_SID7_MASK                                   0x10
#define _B2SIDH_SID8_POSN                                   0x5
#define _B2SIDH_SID8_POSITION                               0x5
#define _B2SIDH_SID8_SIZE                                   0x1
#define _B2SIDH_SID8_LENGTH                                 0x1
#define _B2SIDH_SID8_MASK                                   0x20
#define _B2SIDH_SID9_POSN                                   0x6
#define _B2SIDH_SID9_POSITION                               0x6
#define _B2SIDH_SID9_SIZE                                   0x1
#define _B2SIDH_SID9_LENGTH                                 0x1
#define _B2SIDH_SID9_MASK                                   0x40
#define _B2SIDH_SID10_POSN                                  0x7
#define _B2SIDH_SID10_POSITION                              0x7
#define _B2SIDH_SID10_SIZE                                  0x1
#define _B2SIDH_SID10_LENGTH                                0x1
#define _B2SIDH_SID10_MASK                                  0x80
#define _B2SIDH_B2SID3_POSN                                 0x0
#define _B2SIDH_B2SID3_POSITION                             0x0
#define _B2SIDH_B2SID3_SIZE                                 0x1
#define _B2SIDH_B2SID3_LENGTH                               0x1
#define _B2SIDH_B2SID3_MASK                                 0x1
#define _B2SIDH_B2SID4_POSN                                 0x1
#define _B2SIDH_B2SID4_POSITION                             0x1
#define _B2SIDH_B2SID4_SIZE                                 0x1
#define _B2SIDH_B2SID4_LENGTH                               0x1
#define _B2SIDH_B2SID4_MASK                                 0x2
#define _B2SIDH_B2SID5_POSN                                 0x2
#define _B2SIDH_B2SID5_POSITION                             0x2
#define _B2SIDH_B2SID5_SIZE                                 0x1
#define _B2SIDH_B2SID5_LENGTH                               0x1
#define _B2SIDH_B2SID5_MASK                                 0x4
#define _B2SIDH_B2SID6_POSN                                 0x3
#define _B2SIDH_B2SID6_POSITION                             0x3
#define _B2SIDH_B2SID6_SIZE                                 0x1
#define _B2SIDH_B2SID6_LENGTH                               0x1
#define _B2SIDH_B2SID6_MASK                                 0x8
#define _B2SIDH_B2SID7_POSN                                 0x4
#define _B2SIDH_B2SID7_POSITION                             0x4
#define _B2SIDH_B2SID7_SIZE                                 0x1
#define _B2SIDH_B2SID7_LENGTH                               0x1
#define _B2SIDH_B2SID7_MASK                                 0x10
#define _B2SIDH_B2SID8_POSN                                 0x5
#define _B2SIDH_B2SID8_POSITION                             0x5
#define _B2SIDH_B2SID8_SIZE                                 0x1
#define _B2SIDH_B2SID8_LENGTH                               0x1
#define _B2SIDH_B2SID8_MASK                                 0x20
#define _B2SIDH_B2SID9_POSN                                 0x6
#define _B2SIDH_B2SID9_POSITION                             0x6
#define _B2SIDH_B2SID9_SIZE                                 0x1
#define _B2SIDH_B2SID9_LENGTH                               0x1
#define _B2SIDH_B2SID9_MASK                                 0x40
#define _B2SIDH_B2SID10_POSN                                0x7
#define _B2SIDH_B2SID10_POSITION                            0x7
#define _B2SIDH_B2SID10_SIZE                                0x1
#define _B2SIDH_B2SID10_LENGTH                              0x1
#define _B2SIDH_B2SID10_MASK                                0x80

// Register: B2SIDL
#define B2SIDL B2SIDL
extern volatile unsigned char           B2SIDL              __at(0xEA2);
#ifndef _LIB_BUILD
asm("B2SIDL equ 0EA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned B2EID16                :1;
        unsigned B2EID17                :1;
        unsigned                        :1;
        unsigned B2EXID                 :1;
        unsigned B2SRR                  :1;
        unsigned B2SID0                 :1;
        unsigned B2SID1                 :1;
        unsigned B2SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B2EXIDE                :1;
    };
} B2SIDLbits_t;
extern volatile B2SIDLbits_t B2SIDLbits __at(0xEA2);
// bitfield macros
#define _B2SIDL_EID_POSN                                    0x0
#define _B2SIDL_EID_POSITION                                0x0
#define _B2SIDL_EID_SIZE                                    0x2
#define _B2SIDL_EID_LENGTH                                  0x2
#define _B2SIDL_EID_MASK                                    0x3
#define _B2SIDL_EXIDE_POSN                                  0x3
#define _B2SIDL_EXIDE_POSITION                              0x3
#define _B2SIDL_EXIDE_SIZE                                  0x1
#define _B2SIDL_EXIDE_LENGTH                                0x1
#define _B2SIDL_EXIDE_MASK                                  0x8
#define _B2SIDL_SRR_POSN                                    0x4
#define _B2SIDL_SRR_POSITION                                0x4
#define _B2SIDL_SRR_SIZE                                    0x1
#define _B2SIDL_SRR_LENGTH                                  0x1
#define _B2SIDL_SRR_MASK                                    0x10
#define _B2SIDL_SID_POSN                                    0x5
#define _B2SIDL_SID_POSITION                                0x5
#define _B2SIDL_SID_SIZE                                    0x3
#define _B2SIDL_SID_LENGTH                                  0x3
#define _B2SIDL_SID_MASK                                    0xE0
#define _B2SIDL_EID16_POSN                                  0x0
#define _B2SIDL_EID16_POSITION                              0x0
#define _B2SIDL_EID16_SIZE                                  0x1
#define _B2SIDL_EID16_LENGTH                                0x1
#define _B2SIDL_EID16_MASK                                  0x1
#define _B2SIDL_EID17_POSN                                  0x1
#define _B2SIDL_EID17_POSITION                              0x1
#define _B2SIDL_EID17_SIZE                                  0x1
#define _B2SIDL_EID17_LENGTH                                0x1
#define _B2SIDL_EID17_MASK                                  0x2
#define _B2SIDL_SID0_POSN                                   0x5
#define _B2SIDL_SID0_POSITION                               0x5
#define _B2SIDL_SID0_SIZE                                   0x1
#define _B2SIDL_SID0_LENGTH                                 0x1
#define _B2SIDL_SID0_MASK                                   0x20
#define _B2SIDL_SID1_POSN                                   0x6
#define _B2SIDL_SID1_POSITION                               0x6
#define _B2SIDL_SID1_SIZE                                   0x1
#define _B2SIDL_SID1_LENGTH                                 0x1
#define _B2SIDL_SID1_MASK                                   0x40
#define _B2SIDL_SID2_POSN                                   0x7
#define _B2SIDL_SID2_POSITION                               0x7
#define _B2SIDL_SID2_SIZE                                   0x1
#define _B2SIDL_SID2_LENGTH                                 0x1
#define _B2SIDL_SID2_MASK                                   0x80
#define _B2SIDL_B2EID16_POSN                                0x0
#define _B2SIDL_B2EID16_POSITION                            0x0
#define _B2SIDL_B2EID16_SIZE                                0x1
#define _B2SIDL_B2EID16_LENGTH                              0x1
#define _B2SIDL_B2EID16_MASK                                0x1
#define _B2SIDL_B2EID17_POSN                                0x1
#define _B2SIDL_B2EID17_POSITION                            0x1
#define _B2SIDL_B2EID17_SIZE                                0x1
#define _B2SIDL_B2EID17_LENGTH                              0x1
#define _B2SIDL_B2EID17_MASK                                0x2
#define _B2SIDL_B2EXID_POSN                                 0x3
#define _B2SIDL_B2EXID_POSITION                             0x3
#define _B2SIDL_B2EXID_SIZE                                 0x1
#define _B2SIDL_B2EXID_LENGTH                               0x1
#define _B2SIDL_B2EXID_MASK                                 0x8
#define _B2SIDL_B2SRR_POSN                                  0x4
#define _B2SIDL_B2SRR_POSITION                              0x4
#define _B2SIDL_B2SRR_SIZE                                  0x1
#define _B2SIDL_B2SRR_LENGTH                                0x1
#define _B2SIDL_B2SRR_MASK                                  0x10
#define _B2SIDL_B2SID0_POSN                                 0x5
#define _B2SIDL_B2SID0_POSITION                             0x5
#define _B2SIDL_B2SID0_SIZE                                 0x1
#define _B2SIDL_B2SID0_LENGTH                               0x1
#define _B2SIDL_B2SID0_MASK                                 0x20
#define _B2SIDL_B2SID1_POSN                                 0x6
#define _B2SIDL_B2SID1_POSITION                             0x6
#define _B2SIDL_B2SID1_SIZE                                 0x1
#define _B2SIDL_B2SID1_LENGTH                               0x1
#define _B2SIDL_B2SID1_MASK                                 0x40
#define _B2SIDL_B2SID2_POSN                                 0x7
#define _B2SIDL_B2SID2_POSITION                             0x7
#define _B2SIDL_B2SID2_SIZE                                 0x1
#define _B2SIDL_B2SID2_LENGTH                               0x1
#define _B2SIDL_B2SID2_MASK                                 0x80
#define _B2SIDL_B2EXIDE_POSN                                0x3
#define _B2SIDL_B2EXIDE_POSITION                            0x3
#define _B2SIDL_B2EXIDE_SIZE                                0x1
#define _B2SIDL_B2EXIDE_LENGTH                              0x1
#define _B2SIDL_B2EXIDE_MASK                                0x8

// Register: B2EIDH
#define B2EIDH B2EIDH
extern volatile unsigned char           B2EIDH              __at(0xEA3);
#ifndef _LIB_BUILD
asm("B2EIDH equ 0EA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B2EID8                 :1;
        unsigned B2EID9                 :1;
        unsigned B2EID10                :1;
        unsigned B2EID11                :1;
        unsigned B2EID12                :1;
        unsigned B2EID13                :1;
        unsigned B2EID14                :1;
        unsigned B2EID15                :1;
    };
} B2EIDHbits_t;
extern volatile B2EIDHbits_t B2EIDHbits __at(0xEA3);
// bitfield macros
#define _B2EIDH_EID_POSN                                    0x0
#define _B2EIDH_EID_POSITION                                0x0
#define _B2EIDH_EID_SIZE                                    0x8
#define _B2EIDH_EID_LENGTH                                  0x8
#define _B2EIDH_EID_MASK                                    0xFF
#define _B2EIDH_EID8_POSN                                   0x0
#define _B2EIDH_EID8_POSITION                               0x0
#define _B2EIDH_EID8_SIZE                                   0x1
#define _B2EIDH_EID8_LENGTH                                 0x1
#define _B2EIDH_EID8_MASK                                   0x1
#define _B2EIDH_EID9_POSN                                   0x1
#define _B2EIDH_EID9_POSITION                               0x1
#define _B2EIDH_EID9_SIZE                                   0x1
#define _B2EIDH_EID9_LENGTH                                 0x1
#define _B2EIDH_EID9_MASK                                   0x2
#define _B2EIDH_EID10_POSN                                  0x2
#define _B2EIDH_EID10_POSITION                              0x2
#define _B2EIDH_EID10_SIZE                                  0x1
#define _B2EIDH_EID10_LENGTH                                0x1
#define _B2EIDH_EID10_MASK                                  0x4
#define _B2EIDH_EID11_POSN                                  0x3
#define _B2EIDH_EID11_POSITION                              0x3
#define _B2EIDH_EID11_SIZE                                  0x1
#define _B2EIDH_EID11_LENGTH                                0x1
#define _B2EIDH_EID11_MASK                                  0x8
#define _B2EIDH_EID12_POSN                                  0x4
#define _B2EIDH_EID12_POSITION                              0x4
#define _B2EIDH_EID12_SIZE                                  0x1
#define _B2EIDH_EID12_LENGTH                                0x1
#define _B2EIDH_EID12_MASK                                  0x10
#define _B2EIDH_EID13_POSN                                  0x5
#define _B2EIDH_EID13_POSITION                              0x5
#define _B2EIDH_EID13_SIZE                                  0x1
#define _B2EIDH_EID13_LENGTH                                0x1
#define _B2EIDH_EID13_MASK                                  0x20
#define _B2EIDH_EID14_POSN                                  0x6
#define _B2EIDH_EID14_POSITION                              0x6
#define _B2EIDH_EID14_SIZE                                  0x1
#define _B2EIDH_EID14_LENGTH                                0x1
#define _B2EIDH_EID14_MASK                                  0x40
#define _B2EIDH_EID15_POSN                                  0x7
#define _B2EIDH_EID15_POSITION                              0x7
#define _B2EIDH_EID15_SIZE                                  0x1
#define _B2EIDH_EID15_LENGTH                                0x1
#define _B2EIDH_EID15_MASK                                  0x80
#define _B2EIDH_B2EID8_POSN                                 0x0
#define _B2EIDH_B2EID8_POSITION                             0x0
#define _B2EIDH_B2EID8_SIZE                                 0x1
#define _B2EIDH_B2EID8_LENGTH                               0x1
#define _B2EIDH_B2EID8_MASK                                 0x1
#define _B2EIDH_B2EID9_POSN                                 0x1
#define _B2EIDH_B2EID9_POSITION                             0x1
#define _B2EIDH_B2EID9_SIZE                                 0x1
#define _B2EIDH_B2EID9_LENGTH                               0x1
#define _B2EIDH_B2EID9_MASK                                 0x2
#define _B2EIDH_B2EID10_POSN                                0x2
#define _B2EIDH_B2EID10_POSITION                            0x2
#define _B2EIDH_B2EID10_SIZE                                0x1
#define _B2EIDH_B2EID10_LENGTH                              0x1
#define _B2EIDH_B2EID10_MASK                                0x4
#define _B2EIDH_B2EID11_POSN                                0x3
#define _B2EIDH_B2EID11_POSITION                            0x3
#define _B2EIDH_B2EID11_SIZE                                0x1
#define _B2EIDH_B2EID11_LENGTH                              0x1
#define _B2EIDH_B2EID11_MASK                                0x8
#define _B2EIDH_B2EID12_POSN                                0x4
#define _B2EIDH_B2EID12_POSITION                            0x4
#define _B2EIDH_B2EID12_SIZE                                0x1
#define _B2EIDH_B2EID12_LENGTH                              0x1
#define _B2EIDH_B2EID12_MASK                                0x10
#define _B2EIDH_B2EID13_POSN                                0x5
#define _B2EIDH_B2EID13_POSITION                            0x5
#define _B2EIDH_B2EID13_SIZE                                0x1
#define _B2EIDH_B2EID13_LENGTH                              0x1
#define _B2EIDH_B2EID13_MASK                                0x20
#define _B2EIDH_B2EID14_POSN                                0x6
#define _B2EIDH_B2EID14_POSITION                            0x6
#define _B2EIDH_B2EID14_SIZE                                0x1
#define _B2EIDH_B2EID14_LENGTH                              0x1
#define _B2EIDH_B2EID14_MASK                                0x40
#define _B2EIDH_B2EID15_POSN                                0x7
#define _B2EIDH_B2EID15_POSITION                            0x7
#define _B2EIDH_B2EID15_SIZE                                0x1
#define _B2EIDH_B2EID15_LENGTH                              0x1
#define _B2EIDH_B2EID15_MASK                                0x80

// Register: B2EIDL
#define B2EIDL B2EIDL
extern volatile unsigned char           B2EIDL              __at(0xEA4);
#ifndef _LIB_BUILD
asm("B2EIDL equ 0EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B2EID0                 :1;
        unsigned B2EID1                 :1;
        unsigned B2EID2                 :1;
        unsigned B2EID3                 :1;
        unsigned B2EID4                 :1;
        unsigned B2EID5                 :1;
        unsigned B2EID6                 :1;
        unsigned B2EID7                 :1;
    };
} B2EIDLbits_t;
