MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile B4DLCbits_t B4DLCbits __at(0xEC5);
// bitfield macros
#define _B4DLC_DLC_POSN                                     0x0
#define _B4DLC_DLC_POSITION                                 0x0
#define _B4DLC_DLC_SIZE                                     0x4
#define _B4DLC_DLC_LENGTH                                   0x4
#define _B4DLC_DLC_MASK                                     0xF
#define _B4DLC_RB_POSN                                      0x4
#define _B4DLC_RB_POSITION                                  0x4
#define _B4DLC_RB_SIZE                                      0x2
#define _B4DLC_RB_LENGTH                                    0x2
#define _B4DLC_RB_MASK                                      0x30
#define _B4DLC_RXRTR_TXRTR_POSN                             0x6
#define _B4DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B4DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B4DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B4DLC_RXRTR_TXRTR_MASK                             0x40
#define _B4DLC_DLC0_POSN                                    0x0
#define _B4DLC_DLC0_POSITION                                0x0
#define _B4DLC_DLC0_SIZE                                    0x1
#define _B4DLC_DLC0_LENGTH                                  0x1
#define _B4DLC_DLC0_MASK                                    0x1
#define _B4DLC_DLC1_POSN                                    0x1
#define _B4DLC_DLC1_POSITION                                0x1
#define _B4DLC_DLC1_SIZE                                    0x1
#define _B4DLC_DLC1_LENGTH                                  0x1
#define _B4DLC_DLC1_MASK                                    0x2
#define _B4DLC_DLC2_POSN                                    0x2
#define _B4DLC_DLC2_POSITION                                0x2
#define _B4DLC_DLC2_SIZE                                    0x1
#define _B4DLC_DLC2_LENGTH                                  0x1
#define _B4DLC_DLC2_MASK                                    0x4
#define _B4DLC_DLC3_POSN                                    0x3
#define _B4DLC_DLC3_POSITION                                0x3
#define _B4DLC_DLC3_SIZE                                    0x1
#define _B4DLC_DLC3_LENGTH                                  0x1
#define _B4DLC_DLC3_MASK                                    0x8
#define _B4DLC_RB0_POSN                                     0x4
#define _B4DLC_RB0_POSITION                                 0x4
#define _B4DLC_RB0_SIZE                                     0x1
#define _B4DLC_RB0_LENGTH                                   0x1
#define _B4DLC_RB0_MASK                                     0x10
#define _B4DLC_RB1_POSN                                     0x5
#define _B4DLC_RB1_POSITION                                 0x5
#define _B4DLC_RB1_SIZE                                     0x1
#define _B4DLC_RB1_LENGTH                                   0x1
#define _B4DLC_RB1_MASK                                     0x20
#define _B4DLC_RXRTR_POSN                                   0x6
#define _B4DLC_RXRTR_POSITION                               0x6
#define _B4DLC_RXRTR_SIZE                                   0x1
#define _B4DLC_RXRTR_LENGTH                                 0x1
#define _B4DLC_RXRTR_MASK                                   0x40
#define _B4DLC_TXRTR_POSN                                   0x6
#define _B4DLC_TXRTR_POSITION                               0x6
#define _B4DLC_TXRTR_SIZE                                   0x1
#define _B4DLC_TXRTR_LENGTH                                 0x1
#define _B4DLC_TXRTR_MASK                                   0x40
#define _B4DLC_B4DLC0_POSN                                  0x0
#define _B4DLC_B4DLC0_POSITION                              0x0
#define _B4DLC_B4DLC0_SIZE                                  0x1
#define _B4DLC_B4DLC0_LENGTH                                0x1
#define _B4DLC_B4DLC0_MASK                                  0x1
#define _B4DLC_B4DLC1_POSN                                  0x1
#define _B4DLC_B4DLC1_POSITION                              0x1
#define _B4DLC_B4DLC1_SIZE                                  0x1
#define _B4DLC_B4DLC1_LENGTH                                0x1
#define _B4DLC_B4DLC1_MASK                                  0x2
#define _B4DLC_B4DLC2_POSN                                  0x2
#define _B4DLC_B4DLC2_POSITION                              0x2
#define _B4DLC_B4DLC2_SIZE                                  0x1
#define _B4DLC_B4DLC2_LENGTH                                0x1
#define _B4DLC_B4DLC2_MASK                                  0x4
#define _B4DLC_B4DLC3_POSN                                  0x3
#define _B4DLC_B4DLC3_POSITION                              0x3
#define _B4DLC_B4DLC3_SIZE                                  0x1
#define _B4DLC_B4DLC3_LENGTH                                0x1
#define _B4DLC_B4DLC3_MASK                                  0x8
#define _B4DLC_B4RB0_POSN                                   0x4
#define _B4DLC_B4RB0_POSITION                               0x4
#define _B4DLC_B4RB0_SIZE                                   0x1
#define _B4DLC_B4RB0_LENGTH                                 0x1
#define _B4DLC_B4RB0_MASK                                   0x10
#define _B4DLC_B4RB1_POSN                                   0x5
#define _B4DLC_B4RB1_POSITION                               0x5
#define _B4DLC_B4RB1_SIZE                                   0x1
#define _B4DLC_B4RB1_LENGTH                                 0x1
#define _B4DLC_B4RB1_MASK                                   0x20
#define _B4DLC_B4RXRTR_POSN                                 0x6
#define _B4DLC_B4RXRTR_POSITION                             0x6
#define _B4DLC_B4RXRTR_SIZE                                 0x1
#define _B4DLC_B4RXRTR_LENGTH                               0x1
#define _B4DLC_B4RXRTR_MASK                                 0x40

// Register: B4D0
#define B4D0 B4D0
extern volatile unsigned char           B4D0                __at(0xEC6);
#ifndef _LIB_BUILD
asm("B4D0 equ 0EC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D0                   :8;
    };
    struct {
        unsigned B4D00                  :1;
        unsigned B4D01                  :1;
        unsigned B4D02                  :1;
        unsigned B4D03                  :1;
        unsigned B4D04                  :1;
        unsigned B4D05                  :1;
        unsigned B4D06                  :1;
        unsigned B4D07                  :1;
    };
} B4D0bits_t;
extern volatile B4D0bits_t B4D0bits __at(0xEC6);
// bitfield macros
#define _B4D0_B4D0_POSN                                     0x0
#define _B4D0_B4D0_POSITION                                 0x0
#define _B4D0_B4D0_SIZE                                     0x8
#define _B4D0_B4D0_LENGTH                                   0x8
#define _B4D0_B4D0_MASK                                     0xFF
#define _B4D0_B4D00_POSN                                    0x0
#define _B4D0_B4D00_POSITION                                0x0
#define _B4D0_B4D00_SIZE                                    0x1
#define _B4D0_B4D00_LENGTH                                  0x1
#define _B4D0_B4D00_MASK                                    0x1
#define _B4D0_B4D01_POSN                                    0x1
#define _B4D0_B4D01_POSITION                                0x1
#define _B4D0_B4D01_SIZE                                    0x1
#define _B4D0_B4D01_LENGTH                                  0x1
#define _B4D0_B4D01_MASK                                    0x2
#define _B4D0_B4D02_POSN                                    0x2
#define _B4D0_B4D02_POSITION                                0x2
#define _B4D0_B4D02_SIZE                                    0x1
#define _B4D0_B4D02_LENGTH                                  0x1
#define _B4D0_B4D02_MASK                                    0x4
#define _B4D0_B4D03_POSN                                    0x3
#define _B4D0_B4D03_POSITION                                0x3
#define _B4D0_B4D03_SIZE                                    0x1
#define _B4D0_B4D03_LENGTH                                  0x1
#define _B4D0_B4D03_MASK                                    0x8
#define _B4D0_B4D04_POSN                                    0x4
#define _B4D0_B4D04_POSITION                                0x4
#define _B4D0_B4D04_SIZE                                    0x1
#define _B4D0_B4D04_LENGTH                                  0x1
#define _B4D0_B4D04_MASK                                    0x10
#define _B4D0_B4D05_POSN                                    0x5
#define _B4D0_B4D05_POSITION                                0x5
#define _B4D0_B4D05_SIZE                                    0x1
#define _B4D0_B4D05_LENGTH                                  0x1
#define _B4D0_B4D05_MASK                                    0x20
#define _B4D0_B4D06_POSN                                    0x6
#define _B4D0_B4D06_POSITION                                0x6
#define _B4D0_B4D06_SIZE                                    0x1
#define _B4D0_B4D06_LENGTH                                  0x1
#define _B4D0_B4D06_MASK                                    0x40
#define _B4D0_B4D07_POSN                                    0x7
#define _B4D0_B4D07_POSITION                                0x7
#define _B4D0_B4D07_SIZE                                    0x1
#define _B4D0_B4D07_LENGTH                                  0x1
#define _B4D0_B4D07_MASK                                    0x80

// Register: B4D1
#define B4D1 B4D1
extern volatile unsigned char           B4D1                __at(0xEC7);
#ifndef _LIB_BUILD
asm("B4D1 equ 0EC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D1                   :8;
    };
    struct {
        unsigned B4D10                  :1;
        unsigned B4D11                  :1;
        unsigned B4D12                  :1;
        unsigned B4D13                  :1;
        unsigned B4D14                  :1;
        unsigned B4D15                  :1;
        unsigned B4D16                  :1;
        unsigned B4D17                  :1;
    };
} B4D1bits_t;
extern volatile B4D1bits_t B4D1bits __at(0xEC7);
// bitfield macros
#define _B4D1_B4D1_POSN                                     0x0
#define _B4D1_B4D1_POSITION                                 0x0
#define _B4D1_B4D1_SIZE                                     0x8
#define _B4D1_B4D1_LENGTH                                   0x8
#define _B4D1_B4D1_MASK                                     0xFF
#define _B4D1_B4D10_POSN                                    0x0
#define _B4D1_B4D10_POSITION                                0x0
#define _B4D1_B4D10_SIZE                                    0x1
#define _B4D1_B4D10_LENGTH                                  0x1
#define _B4D1_B4D10_MASK                                    0x1
#define _B4D1_B4D11_POSN                                    0x1
#define _B4D1_B4D11_POSITION                                0x1
#define _B4D1_B4D11_SIZE                                    0x1
#define _B4D1_B4D11_LENGTH                                  0x1
#define _B4D1_B4D11_MASK                                    0x2
#define _B4D1_B4D12_POSN                                    0x2
#define _B4D1_B4D12_POSITION                                0x2
#define _B4D1_B4D12_SIZE                                    0x1
#define _B4D1_B4D12_LENGTH                                  0x1
#define _B4D1_B4D12_MASK                                    0x4
#define _B4D1_B4D13_POSN                                    0x3
#define _B4D1_B4D13_POSITION                                0x3
#define _B4D1_B4D13_SIZE                                    0x1
#define _B4D1_B4D13_LENGTH                                  0x1
#define _B4D1_B4D13_MASK                                    0x8
#define _B4D1_B4D14_POSN                                    0x4
#define _B4D1_B4D14_POSITION                                0x4
#define _B4D1_B4D14_SIZE                                    0x1
#define _B4D1_B4D14_LENGTH                                  0x1
#define _B4D1_B4D14_MASK                                    0x10
#define _B4D1_B4D15_POSN                                    0x5
#define _B4D1_B4D15_POSITION                                0x5
#define _B4D1_B4D15_SIZE                                    0x1
#define _B4D1_B4D15_LENGTH                                  0x1
#define _B4D1_B4D15_MASK                                    0x20
#define _B4D1_B4D16_POSN                                    0x6
#define _B4D1_B4D16_POSITION                                0x6
#define _B4D1_B4D16_SIZE                                    0x1
#define _B4D1_B4D16_LENGTH                                  0x1
#define _B4D1_B4D16_MASK                                    0x40
#define _B4D1_B4D17_POSN                                    0x7
#define _B4D1_B4D17_POSITION                                0x7
#define _B4D1_B4D17_SIZE                                    0x1
#define _B4D1_B4D17_LENGTH                                  0x1
#define _B4D1_B4D17_MASK                                    0x80

// Register: B4D2
#define B4D2 B4D2
extern volatile unsigned char           B4D2                __at(0xEC8);
#ifndef _LIB_BUILD
asm("B4D2 equ 0EC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D2                   :8;
    };
    struct {
        unsigned B4D20                  :1;
        unsigned B4D21                  :1;
        unsigned B4D22                  :1;
        unsigned B4D23                  :1;
        unsigned B4D24                  :1;
        unsigned B4D25                  :1;
        unsigned B4D26                  :1;
        unsigned B4D27                  :1;
    };
} B4D2bits_t;
