MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
// Register: RXF1SIDH
#define RXF1SIDH RXF1SIDH
extern volatile unsigned char           RXF1SIDH            __at(0xEE4);
#ifndef _LIB_BUILD
asm("RXF1SIDH equ 0EE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF1SID3               :1;
        unsigned RXF1SID4               :1;
        unsigned RXF1SID5               :1;
        unsigned RXF1SID6               :1;
        unsigned RXF1SID7               :1;
        unsigned RXF1SID8               :1;
        unsigned RXF1SID9               :1;
        unsigned RXF1SID10              :1;
    };
} RXF1SIDHbits_t;
extern volatile RXF1SIDHbits_t RXF1SIDHbits __at(0xEE4);
// bitfield macros
#define _RXF1SIDH_SID_POSN                                  0x0
#define _RXF1SIDH_SID_POSITION                              0x0
#define _RXF1SIDH_SID_SIZE                                  0x8
#define _RXF1SIDH_SID_LENGTH                                0x8
#define _RXF1SIDH_SID_MASK                                  0xFF
#define _RXF1SIDH_SID3_POSN                                 0x0
#define _RXF1SIDH_SID3_POSITION                             0x0
#define _RXF1SIDH_SID3_SIZE                                 0x1
#define _RXF1SIDH_SID3_LENGTH                               0x1
#define _RXF1SIDH_SID3_MASK                                 0x1
#define _RXF1SIDH_SID4_POSN                                 0x1
#define _RXF1SIDH_SID4_POSITION                             0x1
#define _RXF1SIDH_SID4_SIZE                                 0x1
#define _RXF1SIDH_SID4_LENGTH                               0x1
#define _RXF1SIDH_SID4_MASK                                 0x2
#define _RXF1SIDH_SID5_POSN                                 0x2
#define _RXF1SIDH_SID5_POSITION                             0x2
#define _RXF1SIDH_SID5_SIZE                                 0x1
#define _RXF1SIDH_SID5_LENGTH                               0x1
#define _RXF1SIDH_SID5_MASK                                 0x4
#define _RXF1SIDH_SID6_POSN                                 0x3
#define _RXF1SIDH_SID6_POSITION                             0x3
#define _RXF1SIDH_SID6_SIZE                                 0x1
#define _RXF1SIDH_SID6_LENGTH                               0x1
#define _RXF1SIDH_SID6_MASK                                 0x8
#define _RXF1SIDH_SID7_POSN                                 0x4
#define _RXF1SIDH_SID7_POSITION                             0x4
#define _RXF1SIDH_SID7_SIZE                                 0x1
#define _RXF1SIDH_SID7_LENGTH                               0x1
#define _RXF1SIDH_SID7_MASK                                 0x10
#define _RXF1SIDH_SID8_POSN                                 0x5
#define _RXF1SIDH_SID8_POSITION                             0x5
#define _RXF1SIDH_SID8_SIZE                                 0x1
#define _RXF1SIDH_SID8_LENGTH                               0x1
#define _RXF1SIDH_SID8_MASK                                 0x20
#define _RXF1SIDH_SID9_POSN                                 0x6
#define _RXF1SIDH_SID9_POSITION                             0x6
#define _RXF1SIDH_SID9_SIZE                                 0x1
#define _RXF1SIDH_SID9_LENGTH                               0x1
#define _RXF1SIDH_SID9_MASK                                 0x40
#define _RXF1SIDH_SID10_POSN                                0x7
#define _RXF1SIDH_SID10_POSITION                            0x7
#define _RXF1SIDH_SID10_SIZE                                0x1
#define _RXF1SIDH_SID10_LENGTH                              0x1
#define _RXF1SIDH_SID10_MASK                                0x80
#define _RXF1SIDH_RXF1SID3_POSN                             0x0
#define _RXF1SIDH_RXF1SID3_POSITION                         0x0
#define _RXF1SIDH_RXF1SID3_SIZE                             0x1
#define _RXF1SIDH_RXF1SID3_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID3_MASK                             0x1
#define _RXF1SIDH_RXF1SID4_POSN                             0x1
#define _RXF1SIDH_RXF1SID4_POSITION                         0x1
#define _RXF1SIDH_RXF1SID4_SIZE                             0x1
#define _RXF1SIDH_RXF1SID4_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID4_MASK                             0x2
#define _RXF1SIDH_RXF1SID5_POSN                             0x2
#define _RXF1SIDH_RXF1SID5_POSITION                         0x2
#define _RXF1SIDH_RXF1SID5_SIZE                             0x1
#define _RXF1SIDH_RXF1SID5_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID5_MASK                             0x4
#define _RXF1SIDH_RXF1SID6_POSN                             0x3
#define _RXF1SIDH_RXF1SID6_POSITION                         0x3
#define _RXF1SIDH_RXF1SID6_SIZE                             0x1
#define _RXF1SIDH_RXF1SID6_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID6_MASK                             0x8
#define _RXF1SIDH_RXF1SID7_POSN                             0x4
#define _RXF1SIDH_RXF1SID7_POSITION                         0x4
#define _RXF1SIDH_RXF1SID7_SIZE                             0x1
#define _RXF1SIDH_RXF1SID7_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID7_MASK                             0x10
#define _RXF1SIDH_RXF1SID8_POSN                             0x5
#define _RXF1SIDH_RXF1SID8_POSITION                         0x5
#define _RXF1SIDH_RXF1SID8_SIZE                             0x1
#define _RXF1SIDH_RXF1SID8_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID8_MASK                             0x20
#define _RXF1SIDH_RXF1SID9_POSN                             0x6
#define _RXF1SIDH_RXF1SID9_POSITION                         0x6
#define _RXF1SIDH_RXF1SID9_SIZE                             0x1
#define _RXF1SIDH_RXF1SID9_LENGTH                           0x1
#define _RXF1SIDH_RXF1SID9_MASK                             0x40
#define _RXF1SIDH_RXF1SID10_POSN                            0x7
#define _RXF1SIDH_RXF1SID10_POSITION                        0x7
#define _RXF1SIDH_RXF1SID10_SIZE                            0x1
#define _RXF1SIDH_RXF1SID10_LENGTH                          0x1
#define _RXF1SIDH_RXF1SID10_MASK                            0x80

// Register: RXF1SIDL
#define RXF1SIDL RXF1SIDL
extern volatile unsigned char           RXF1SIDL            __at(0xEE5);
#ifndef _LIB_BUILD
asm("RXF1SIDL equ 0EE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF1EID16              :1;
        unsigned RXF1EID17              :1;
        unsigned                        :1;
        unsigned RXF1EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF1SID0               :1;
        unsigned RXF1SID1               :1;
        unsigned RXF1SID2               :1;
    };
} RXF1SIDLbits_t;
