MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile TXB1DLCbits_t TXB1DLCbits __at(0xF15);
// bitfield macros
#define _TXB1DLC_DLC_POSN                                   0x0
#define _TXB1DLC_DLC_POSITION                               0x0
#define _TXB1DLC_DLC_SIZE                                   0x4
#define _TXB1DLC_DLC_LENGTH                                 0x4
#define _TXB1DLC_DLC_MASK                                   0xF
#define _TXB1DLC_TXRTR_POSN                                 0x6
#define _TXB1DLC_TXRTR_POSITION                             0x6
#define _TXB1DLC_TXRTR_SIZE                                 0x1
#define _TXB1DLC_TXRTR_LENGTH                               0x1
#define _TXB1DLC_TXRTR_MASK                                 0x40
#define _TXB1DLC_DLC0_POSN                                  0x0
#define _TXB1DLC_DLC0_POSITION                              0x0
#define _TXB1DLC_DLC0_SIZE                                  0x1
#define _TXB1DLC_DLC0_LENGTH                                0x1
#define _TXB1DLC_DLC0_MASK                                  0x1
#define _TXB1DLC_DLC1_POSN                                  0x1
#define _TXB1DLC_DLC1_POSITION                              0x1
#define _TXB1DLC_DLC1_SIZE                                  0x1
#define _TXB1DLC_DLC1_LENGTH                                0x1
#define _TXB1DLC_DLC1_MASK                                  0x2
#define _TXB1DLC_DLC2_POSN                                  0x2
#define _TXB1DLC_DLC2_POSITION                              0x2
#define _TXB1DLC_DLC2_SIZE                                  0x1
#define _TXB1DLC_DLC2_LENGTH                                0x1
#define _TXB1DLC_DLC2_MASK                                  0x4
#define _TXB1DLC_DLC3_POSN                                  0x3
#define _TXB1DLC_DLC3_POSITION                              0x3
#define _TXB1DLC_DLC3_SIZE                                  0x1
#define _TXB1DLC_DLC3_LENGTH                                0x1
#define _TXB1DLC_DLC3_MASK                                  0x8
#define _TXB1DLC_TXB1DLC0_POSN                              0x0
#define _TXB1DLC_TXB1DLC0_POSITION                          0x0
#define _TXB1DLC_TXB1DLC0_SIZE                              0x1
#define _TXB1DLC_TXB1DLC0_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC0_MASK                              0x1
#define _TXB1DLC_TXB1DLC1_POSN                              0x1
#define _TXB1DLC_TXB1DLC1_POSITION                          0x1
#define _TXB1DLC_TXB1DLC1_SIZE                              0x1
#define _TXB1DLC_TXB1DLC1_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC1_MASK                              0x2
#define _TXB1DLC_TXB1DLC2_POSN                              0x2
#define _TXB1DLC_TXB1DLC2_POSITION                          0x2
#define _TXB1DLC_TXB1DLC2_SIZE                              0x1
#define _TXB1DLC_TXB1DLC2_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC2_MASK                              0x4
#define _TXB1DLC_TXB1DLC3_POSN                              0x3
#define _TXB1DLC_TXB1DLC3_POSITION                          0x3
#define _TXB1DLC_TXB1DLC3_SIZE                              0x1
#define _TXB1DLC_TXB1DLC3_LENGTH                            0x1
#define _TXB1DLC_TXB1DLC3_MASK                              0x8
#define _TXB1DLC_TXB1RTR_POSN                               0x6
#define _TXB1DLC_TXB1RTR_POSITION                           0x6
#define _TXB1DLC_TXB1RTR_SIZE                               0x1
#define _TXB1DLC_TXB1RTR_LENGTH                             0x1
#define _TXB1DLC_TXB1RTR_MASK                               0x40

// Register: TXB1D0
#define TXB1D0 TXB1D0
extern volatile unsigned char           TXB1D0              __at(0xF16);
#ifndef _LIB_BUILD
asm("TXB1D0 equ 0F16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D0                 :8;
    };
    struct {
        unsigned TXB1D00                :1;
        unsigned TXB1D01                :1;
        unsigned TXB1D02                :1;
        unsigned TXB1D03                :1;
        unsigned TXB1D04                :1;
        unsigned TXB1D05                :1;
        unsigned TXB1D06                :1;
        unsigned TXB1D07                :1;
    };
} TXB1D0bits_t;
extern volatile TXB1D0bits_t TXB1D0bits __at(0xF16);
// bitfield macros
#define _TXB1D0_TXB1D0_POSN                                 0x0
#define _TXB1D0_TXB1D0_POSITION                             0x0
#define _TXB1D0_TXB1D0_SIZE                                 0x8
#define _TXB1D0_TXB1D0_LENGTH                               0x8
#define _TXB1D0_TXB1D0_MASK                                 0xFF
#define _TXB1D0_TXB1D00_POSN                                0x0
#define _TXB1D0_TXB1D00_POSITION                            0x0
#define _TXB1D0_TXB1D00_SIZE                                0x1
#define _TXB1D0_TXB1D00_LENGTH                              0x1
#define _TXB1D0_TXB1D00_MASK                                0x1
#define _TXB1D0_TXB1D01_POSN                                0x1
#define _TXB1D0_TXB1D01_POSITION                            0x1
#define _TXB1D0_TXB1D01_SIZE                                0x1
#define _TXB1D0_TXB1D01_LENGTH                              0x1
#define _TXB1D0_TXB1D01_MASK                                0x2
#define _TXB1D0_TXB1D02_POSN                                0x2
#define _TXB1D0_TXB1D02_POSITION                            0x2
#define _TXB1D0_TXB1D02_SIZE                                0x1
#define _TXB1D0_TXB1D02_LENGTH                              0x1
#define _TXB1D0_TXB1D02_MASK                                0x4
#define _TXB1D0_TXB1D03_POSN                                0x3
#define _TXB1D0_TXB1D03_POSITION                            0x3
#define _TXB1D0_TXB1D03_SIZE                                0x1
#define _TXB1D0_TXB1D03_LENGTH                              0x1
#define _TXB1D0_TXB1D03_MASK                                0x8
#define _TXB1D0_TXB1D04_POSN                                0x4
#define _TXB1D0_TXB1D04_POSITION                            0x4
#define _TXB1D0_TXB1D04_SIZE                                0x1
#define _TXB1D0_TXB1D04_LENGTH                              0x1
#define _TXB1D0_TXB1D04_MASK                                0x10
#define _TXB1D0_TXB1D05_POSN                                0x5
#define _TXB1D0_TXB1D05_POSITION                            0x5
#define _TXB1D0_TXB1D05_SIZE                                0x1
#define _TXB1D0_TXB1D05_LENGTH                              0x1
#define _TXB1D0_TXB1D05_MASK                                0x20
#define _TXB1D0_TXB1D06_POSN                                0x6
#define _TXB1D0_TXB1D06_POSITION                            0x6
#define _TXB1D0_TXB1D06_SIZE                                0x1
#define _TXB1D0_TXB1D06_LENGTH                              0x1
#define _TXB1D0_TXB1D06_MASK                                0x40
#define _TXB1D0_TXB1D07_POSN                                0x7
#define _TXB1D0_TXB1D07_POSITION                            0x7
#define _TXB1D0_TXB1D07_SIZE                                0x1
#define _TXB1D0_TXB1D07_LENGTH                              0x1
#define _TXB1D0_TXB1D07_MASK                                0x80

// Register: TXB1D1
#define TXB1D1 TXB1D1
extern volatile unsigned char           TXB1D1              __at(0xF17);
#ifndef _LIB_BUILD
asm("TXB1D1 equ 0F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D1                 :8;
    };
    struct {
        unsigned TXB1D10                :1;
        unsigned TXB1D11                :1;
        unsigned TXB1D12                :1;
        unsigned TXB1D13                :1;
        unsigned TXB1D14                :1;
        unsigned TXB1D15                :1;
        unsigned TXB1D16                :1;
        unsigned TXB1D17                :1;
    };
} TXB1D1bits_t;
extern volatile TXB1D1bits_t TXB1D1bits __at(0xF17);
// bitfield macros
#define _TXB1D1_TXB1D1_POSN                                 0x0
#define _TXB1D1_TXB1D1_POSITION                             0x0
#define _TXB1D1_TXB1D1_SIZE                                 0x8
#define _TXB1D1_TXB1D1_LENGTH                               0x8
#define _TXB1D1_TXB1D1_MASK                                 0xFF
#define _TXB1D1_TXB1D10_POSN                                0x0
#define _TXB1D1_TXB1D10_POSITION                            0x0
#define _TXB1D1_TXB1D10_SIZE                                0x1
#define _TXB1D1_TXB1D10_LENGTH                              0x1
#define _TXB1D1_TXB1D10_MASK                                0x1
#define _TXB1D1_TXB1D11_POSN                                0x1
#define _TXB1D1_TXB1D11_POSITION                            0x1
#define _TXB1D1_TXB1D11_SIZE                                0x1
#define _TXB1D1_TXB1D11_LENGTH                              0x1
#define _TXB1D1_TXB1D11_MASK                                0x2
#define _TXB1D1_TXB1D12_POSN                                0x2
#define _TXB1D1_TXB1D12_POSITION                            0x2
#define _TXB1D1_TXB1D12_SIZE                                0x1
#define _TXB1D1_TXB1D12_LENGTH                              0x1
#define _TXB1D1_TXB1D12_MASK                                0x4
#define _TXB1D1_TXB1D13_POSN                                0x3
#define _TXB1D1_TXB1D13_POSITION                            0x3
#define _TXB1D1_TXB1D13_SIZE                                0x1
#define _TXB1D1_TXB1D13_LENGTH                              0x1
#define _TXB1D1_TXB1D13_MASK                                0x8
#define _TXB1D1_TXB1D14_POSN                                0x4
#define _TXB1D1_TXB1D14_POSITION                            0x4
#define _TXB1D1_TXB1D14_SIZE                                0x1
#define _TXB1D1_TXB1D14_LENGTH                              0x1
#define _TXB1D1_TXB1D14_MASK                                0x10
#define _TXB1D1_TXB1D15_POSN                                0x5
#define _TXB1D1_TXB1D15_POSITION                            0x5
#define _TXB1D1_TXB1D15_SIZE                                0x1
#define _TXB1D1_TXB1D15_LENGTH                              0x1
#define _TXB1D1_TXB1D15_MASK                                0x20
#define _TXB1D1_TXB1D16_POSN                                0x6
#define _TXB1D1_TXB1D16_POSITION                            0x6
#define _TXB1D1_TXB1D16_SIZE                                0x1
#define _TXB1D1_TXB1D16_LENGTH                              0x1
#define _TXB1D1_TXB1D16_MASK                                0x40
#define _TXB1D1_TXB1D17_POSN                                0x7
#define _TXB1D1_TXB1D17_POSITION                            0x7
#define _TXB1D1_TXB1D17_SIZE                                0x1
#define _TXB1D1_TXB1D17_LENGTH                              0x1
#define _TXB1D1_TXB1D17_MASK                                0x80

// Register: TXB1D2
#define TXB1D2 TXB1D2
extern volatile unsigned char           TXB1D2              __at(0xF18);
#ifndef _LIB_BUILD
asm("TXB1D2 equ 0F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D2                 :8;
    };
    struct {
        unsigned TXB1D20                :1;
        unsigned TXB1D21                :1;
        unsigned TXB1D22                :1;
        unsigned TXB1D23                :1;
        unsigned TXB1D24                :1;
        unsigned TXB1D25                :1;
        unsigned TXB1D26                :1;
        unsigned TXB1D27                :1;
    };
} TXB1D2bits_t;
extern volatile TXB1D2bits_t TXB1D2bits __at(0xF18);
// bitfield macros
#define _TXB1D2_TXB1D2_POSN                                 0x0
#define _TXB1D2_TXB1D2_POSITION                             0x0
#define _TXB1D2_TXB1D2_SIZE                                 0x8
#define _TXB1D2_TXB1D2_LENGTH                               0x8
#define _TXB1D2_TXB1D2_MASK                                 0xFF
#define _TXB1D2_TXB1D20_POSN                                0x0
#define _TXB1D2_TXB1D20_POSITION                            0x0
#define _TXB1D2_TXB1D20_SIZE                                0x1
#define _TXB1D2_TXB1D20_LENGTH                              0x1
#define _TXB1D2_TXB1D20_MASK                                0x1
#define _TXB1D2_TXB1D21_POSN                                0x1
#define _TXB1D2_TXB1D21_POSITION                            0x1
#define _TXB1D2_TXB1D21_SIZE                                0x1
#define _TXB1D2_TXB1D21_LENGTH                              0x1
#define _TXB1D2_TXB1D21_MASK                                0x2
#define _TXB1D2_TXB1D22_POSN                                0x2
#define _TXB1D2_TXB1D22_POSITION                            0x2
#define _TXB1D2_TXB1D22_SIZE                                0x1
#define _TXB1D2_TXB1D22_LENGTH                              0x1
#define _TXB1D2_TXB1D22_MASK                                0x4
#define _TXB1D2_TXB1D23_POSN                                0x3
#define _TXB1D2_TXB1D23_POSITION                            0x3
#define _TXB1D2_TXB1D23_SIZE                                0x1
#define _TXB1D2_TXB1D23_LENGTH                              0x1
#define _TXB1D2_TXB1D23_MASK                                0x8
#define _TXB1D2_TXB1D24_POSN                                0x4
#define _TXB1D2_TXB1D24_POSITION                            0x4
#define _TXB1D2_TXB1D24_SIZE                                0x1
#define _TXB1D2_TXB1D24_LENGTH                              0x1
#define _TXB1D2_TXB1D24_MASK                                0x10
#define _TXB1D2_TXB1D25_POSN                                0x5
#define _TXB1D2_TXB1D25_POSITION                            0x5
#define _TXB1D2_TXB1D25_SIZE                                0x1
#define _TXB1D2_TXB1D25_LENGTH                              0x1
#define _TXB1D2_TXB1D25_MASK                                0x20
#define _TXB1D2_TXB1D26_POSN                                0x6
#define _TXB1D2_TXB1D26_POSITION                            0x6
#define _TXB1D2_TXB1D26_SIZE                                0x1
#define _TXB1D2_TXB1D26_LENGTH                              0x1
#define _TXB1D2_TXB1D26_MASK                                0x40
#define _TXB1D2_TXB1D27_POSN                                0x7
#define _TXB1D2_TXB1D27_POSITION                            0x7
#define _TXB1D2_TXB1D27_SIZE                                0x1
#define _TXB1D2_TXB1D27_LENGTH                              0x1
#define _TXB1D2_TXB1D27_MASK                                0x80

// Register: TXB1D3
#define TXB1D3 TXB1D3
extern volatile unsigned char           TXB1D3              __at(0xF19);
#ifndef _LIB_BUILD
asm("TXB1D3 equ 0F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB1D3                 :8;
    };
    struct {
        unsigned TXB1D30                :1;
        unsigned TXB1D31                :1;
        unsigned TXB1D32                :1;
        unsigned TXB1D33                :1;
        unsigned TXB1D34                :1;
        unsigned TXB1D35                :1;
        unsigned TXB1D36                :1;
        unsigned TXB1D37                :1;
    };
} TXB1D3bits_t;
