MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile CANCON_RO2bits_t CANCON_RO2bits __at(0xF1F);
// bitfield macros
#define _CANCON_RO2_FP0_POSN                                0x0
#define _CANCON_RO2_FP0_POSITION                            0x0
#define _CANCON_RO2_FP0_SIZE                                0x1
#define _CANCON_RO2_FP0_LENGTH                              0x1
#define _CANCON_RO2_FP0_MASK                                0x1
#define _CANCON_RO2_WIN0_FP1_POSN                           0x1
#define _CANCON_RO2_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO2_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO2_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO2_WIN0_FP1_MASK                           0x2
#define _CANCON_RO2_WIN1_FP2_POSN                           0x2
#define _CANCON_RO2_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO2_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO2_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO2_WIN1_FP2_MASK                           0x4
#define _CANCON_RO2_WIN2_FP3_POSN                           0x3
#define _CANCON_RO2_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO2_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO2_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO2_WIN2_FP3_MASK                           0x8
#define _CANCON_RO2_ABAT_POSN                               0x4
#define _CANCON_RO2_ABAT_POSITION                           0x4
#define _CANCON_RO2_ABAT_SIZE                               0x1
#define _CANCON_RO2_ABAT_LENGTH                             0x1
#define _CANCON_RO2_ABAT_MASK                               0x10
#define _CANCON_RO2_REQOP_POSN                              0x5
#define _CANCON_RO2_REQOP_POSITION                          0x5
#define _CANCON_RO2_REQOP_SIZE                              0x3
#define _CANCON_RO2_REQOP_LENGTH                            0x3
#define _CANCON_RO2_REQOP_MASK                              0xE0
#define _CANCON_RO2_WIN0_POSN                               0x1
#define _CANCON_RO2_WIN0_POSITION                           0x1
#define _CANCON_RO2_WIN0_SIZE                               0x1
#define _CANCON_RO2_WIN0_LENGTH                             0x1
#define _CANCON_RO2_WIN0_MASK                               0x2
#define _CANCON_RO2_WIN1_POSN                               0x2
#define _CANCON_RO2_WIN1_POSITION                           0x2
#define _CANCON_RO2_WIN1_SIZE                               0x1
#define _CANCON_RO2_WIN1_LENGTH                             0x1
#define _CANCON_RO2_WIN1_MASK                               0x4
#define _CANCON_RO2_WIN2_POSN                               0x3
#define _CANCON_RO2_WIN2_POSITION                           0x3
#define _CANCON_RO2_WIN2_SIZE                               0x1
#define _CANCON_RO2_WIN2_LENGTH                             0x1
#define _CANCON_RO2_WIN2_MASK                               0x8
#define _CANCON_RO2_FP1_POSN                                0x1
#define _CANCON_RO2_FP1_POSITION                            0x1
#define _CANCON_RO2_FP1_SIZE                                0x1
#define _CANCON_RO2_FP1_LENGTH                              0x1
#define _CANCON_RO2_FP1_MASK                                0x2
#define _CANCON_RO2_FP2_POSN                                0x2
#define _CANCON_RO2_FP2_POSITION                            0x2
#define _CANCON_RO2_FP2_SIZE                                0x1
#define _CANCON_RO2_FP2_LENGTH                              0x1
#define _CANCON_RO2_FP2_MASK                                0x4
#define _CANCON_RO2_FP3_POSN                                0x3
#define _CANCON_RO2_FP3_POSITION                            0x3
#define _CANCON_RO2_FP3_SIZE                                0x1
#define _CANCON_RO2_FP3_LENGTH                              0x1
#define _CANCON_RO2_FP3_MASK                                0x8

// Register: TXB0CON
#define TXB0CON TXB0CON
extern volatile unsigned char           TXB0CON             __at(0xF20);
#ifndef _LIB_BUILD
asm("TXB0CON equ 0F20h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXPRI                  :2;
        unsigned                        :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
    };
    struct {
        unsigned TXB0PRI0               :1;
        unsigned TXB0PRI1               :1;
        unsigned                        :1;
        unsigned TXB0REQ                :1;
        unsigned TXB0ERR                :1;
        unsigned TXB0LARB               :1;
        unsigned TXB0ABT                :1;
        unsigned TX0IF                  :1;
    };
} TXB0CONbits_t;
extern volatile TXB0CONbits_t TXB0CONbits __at(0xF20);
// bitfield macros
#define _TXB0CON_TXPRI_POSN                                 0x0
#define _TXB0CON_TXPRI_POSITION                             0x0
#define _TXB0CON_TXPRI_SIZE                                 0x2
#define _TXB0CON_TXPRI_LENGTH                               0x2
#define _TXB0CON_TXPRI_MASK                                 0x3
#define _TXB0CON_TXREQ_POSN                                 0x3
#define _TXB0CON_TXREQ_POSITION                             0x3
#define _TXB0CON_TXREQ_SIZE                                 0x1
#define _TXB0CON_TXREQ_LENGTH                               0x1
#define _TXB0CON_TXREQ_MASK                                 0x8
#define _TXB0CON_TXERR_POSN                                 0x4
#define _TXB0CON_TXERR_POSITION                             0x4
#define _TXB0CON_TXERR_SIZE                                 0x1
#define _TXB0CON_TXERR_LENGTH                               0x1
#define _TXB0CON_TXERR_MASK                                 0x10
#define _TXB0CON_TXLARB_POSN                                0x5
#define _TXB0CON_TXLARB_POSITION                            0x5
#define _TXB0CON_TXLARB_SIZE                                0x1
#define _TXB0CON_TXLARB_LENGTH                              0x1
#define _TXB0CON_TXLARB_MASK                                0x20
#define _TXB0CON_TXABT_POSN                                 0x6
#define _TXB0CON_TXABT_POSITION                             0x6
#define _TXB0CON_TXABT_SIZE                                 0x1
#define _TXB0CON_TXABT_LENGTH                               0x1
#define _TXB0CON_TXABT_MASK                                 0x40
#define _TXB0CON_TXBIF_POSN                                 0x7
#define _TXB0CON_TXBIF_POSITION                             0x7
#define _TXB0CON_TXBIF_SIZE                                 0x1
#define _TXB0CON_TXBIF_LENGTH                               0x1
#define _TXB0CON_TXBIF_MASK                                 0x80
#define _TXB0CON_TXPRI0_POSN                                0x0
#define _TXB0CON_TXPRI0_POSITION                            0x0
#define _TXB0CON_TXPRI0_SIZE                                0x1
#define _TXB0CON_TXPRI0_LENGTH                              0x1
#define _TXB0CON_TXPRI0_MASK                                0x1
#define _TXB0CON_TXPRI1_POSN                                0x1
#define _TXB0CON_TXPRI1_POSITION                            0x1
#define _TXB0CON_TXPRI1_SIZE                                0x1
#define _TXB0CON_TXPRI1_LENGTH                              0x1
#define _TXB0CON_TXPRI1_MASK                                0x2
#define _TXB0CON_TXB0PRI0_POSN                              0x0
#define _TXB0CON_TXB0PRI0_POSITION                          0x0
#define _TXB0CON_TXB0PRI0_SIZE                              0x1
#define _TXB0CON_TXB0PRI0_LENGTH                            0x1
#define _TXB0CON_TXB0PRI0_MASK                              0x1
#define _TXB0CON_TXB0PRI1_POSN                              0x1
#define _TXB0CON_TXB0PRI1_POSITION                          0x1
#define _TXB0CON_TXB0PRI1_SIZE                              0x1
#define _TXB0CON_TXB0PRI1_LENGTH                            0x1
#define _TXB0CON_TXB0PRI1_MASK                              0x2
#define _TXB0CON_TXB0REQ_POSN                               0x3
#define _TXB0CON_TXB0REQ_POSITION                           0x3
#define _TXB0CON_TXB0REQ_SIZE                               0x1
#define _TXB0CON_TXB0REQ_LENGTH                             0x1
#define _TXB0CON_TXB0REQ_MASK                               0x8
#define _TXB0CON_TXB0ERR_POSN                               0x4
#define _TXB0CON_TXB0ERR_POSITION                           0x4
#define _TXB0CON_TXB0ERR_SIZE                               0x1
#define _TXB0CON_TXB0ERR_LENGTH                             0x1
#define _TXB0CON_TXB0ERR_MASK                               0x10
#define _TXB0CON_TXB0LARB_POSN                              0x5
#define _TXB0CON_TXB0LARB_POSITION                          0x5
#define _TXB0CON_TXB0LARB_SIZE                              0x1
#define _TXB0CON_TXB0LARB_LENGTH                            0x1
#define _TXB0CON_TXB0LARB_MASK                              0x20
#define _TXB0CON_TXB0ABT_POSN                               0x6
#define _TXB0CON_TXB0ABT_POSITION                           0x6
#define _TXB0CON_TXB0ABT_SIZE                               0x1
#define _TXB0CON_TXB0ABT_LENGTH                             0x1
#define _TXB0CON_TXB0ABT_MASK                               0x40
#define _TXB0CON_TX0IF_POSN                                 0x7
#define _TXB0CON_TX0IF_POSITION                             0x7
#define _TXB0CON_TX0IF_SIZE                                 0x1
#define _TXB0CON_TX0IF_LENGTH                               0x1
#define _TXB0CON_TX0IF_MASK                                 0x80

// Register: TXB0SIDH
#define TXB0SIDH TXB0SIDH
extern volatile unsigned char           TXB0SIDH            __at(0xF21);
#ifndef _LIB_BUILD
asm("TXB0SIDH equ 0F21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned TXB0SID3               :1;
        unsigned TXB0SID4               :1;
        unsigned TXB0SID5               :1;
        unsigned TXB0SID6               :1;
        unsigned TXB0SID7               :1;
        unsigned TXB0SID8               :1;
        unsigned TXB0SID9               :1;
        unsigned TXB0SID10              :1;
    };
} TXB0SIDHbits_t;
extern volatile TXB0SIDHbits_t TXB0SIDHbits __at(0xF21);
// bitfield macros
#define _TXB0SIDH_SID_POSN                                  0x0
#define _TXB0SIDH_SID_POSITION                              0x0
#define _TXB0SIDH_SID_SIZE                                  0x8
#define _TXB0SIDH_SID_LENGTH                                0x8
#define _TXB0SIDH_SID_MASK                                  0xFF
#define _TXB0SIDH_SID3_POSN                                 0x0
#define _TXB0SIDH_SID3_POSITION                             0x0
#define _TXB0SIDH_SID3_SIZE                                 0x1
#define _TXB0SIDH_SID3_LENGTH                               0x1
#define _TXB0SIDH_SID3_MASK                                 0x1
#define _TXB0SIDH_SID4_POSN                                 0x1
#define _TXB0SIDH_SID4_POSITION                             0x1
#define _TXB0SIDH_SID4_SIZE                                 0x1
#define _TXB0SIDH_SID4_LENGTH                               0x1
#define _TXB0SIDH_SID4_MASK                                 0x2
#define _TXB0SIDH_SID5_POSN                                 0x2
#define _TXB0SIDH_SID5_POSITION                             0x2
#define _TXB0SIDH_SID5_SIZE                                 0x1
#define _TXB0SIDH_SID5_LENGTH                               0x1
#define _TXB0SIDH_SID5_MASK                                 0x4
#define _TXB0SIDH_SID6_POSN                                 0x3
#define _TXB0SIDH_SID6_POSITION                             0x3
#define _TXB0SIDH_SID6_SIZE                                 0x1
#define _TXB0SIDH_SID6_LENGTH                               0x1
#define _TXB0SIDH_SID6_MASK                                 0x8
#define _TXB0SIDH_SID7_POSN                                 0x4
#define _TXB0SIDH_SID7_POSITION                             0x4
#define _TXB0SIDH_SID7_SIZE                                 0x1
#define _TXB0SIDH_SID7_LENGTH                               0x1
#define _TXB0SIDH_SID7_MASK                                 0x10
#define _TXB0SIDH_SID8_POSN                                 0x5
#define _TXB0SIDH_SID8_POSITION                             0x5
#define _TXB0SIDH_SID8_SIZE                                 0x1
#define _TXB0SIDH_SID8_LENGTH                               0x1
#define _TXB0SIDH_SID8_MASK                                 0x20
#define _TXB0SIDH_SID9_POSN                                 0x6
#define _TXB0SIDH_SID9_POSITION                             0x6
#define _TXB0SIDH_SID9_SIZE                                 0x1
#define _TXB0SIDH_SID9_LENGTH                               0x1
#define _TXB0SIDH_SID9_MASK                                 0x40
#define _TXB0SIDH_SID10_POSN                                0x7
#define _TXB0SIDH_SID10_POSITION                            0x7
#define _TXB0SIDH_SID10_SIZE                                0x1
#define _TXB0SIDH_SID10_LENGTH                              0x1
#define _TXB0SIDH_SID10_MASK                                0x80
#define _TXB0SIDH_TXB0SID3_POSN                             0x0
#define _TXB0SIDH_TXB0SID3_POSITION                         0x0
#define _TXB0SIDH_TXB0SID3_SIZE                             0x1
#define _TXB0SIDH_TXB0SID3_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID3_MASK                             0x1
#define _TXB0SIDH_TXB0SID4_POSN                             0x1
#define _TXB0SIDH_TXB0SID4_POSITION                         0x1
#define _TXB0SIDH_TXB0SID4_SIZE                             0x1
#define _TXB0SIDH_TXB0SID4_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID4_MASK                             0x2
#define _TXB0SIDH_TXB0SID5_POSN                             0x2
#define _TXB0SIDH_TXB0SID5_POSITION                         0x2
#define _TXB0SIDH_TXB0SID5_SIZE                             0x1
#define _TXB0SIDH_TXB0SID5_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID5_MASK                             0x4
#define _TXB0SIDH_TXB0SID6_POSN                             0x3
#define _TXB0SIDH_TXB0SID6_POSITION                         0x3
#define _TXB0SIDH_TXB0SID6_SIZE                             0x1
#define _TXB0SIDH_TXB0SID6_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID6_MASK                             0x8
#define _TXB0SIDH_TXB0SID7_POSN                             0x4
#define _TXB0SIDH_TXB0SID7_POSITION                         0x4
#define _TXB0SIDH_TXB0SID7_SIZE                             0x1
#define _TXB0SIDH_TXB0SID7_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID7_MASK                             0x10
#define _TXB0SIDH_TXB0SID8_POSN                             0x5
#define _TXB0SIDH_TXB0SID8_POSITION                         0x5
#define _TXB0SIDH_TXB0SID8_SIZE                             0x1
#define _TXB0SIDH_TXB0SID8_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID8_MASK                             0x20
#define _TXB0SIDH_TXB0SID9_POSN                             0x6
#define _TXB0SIDH_TXB0SID9_POSITION                         0x6
#define _TXB0SIDH_TXB0SID9_SIZE                             0x1
#define _TXB0SIDH_TXB0SID9_LENGTH                           0x1
#define _TXB0SIDH_TXB0SID9_MASK                             0x40
#define _TXB0SIDH_TXB0SID10_POSN                            0x7
#define _TXB0SIDH_TXB0SID10_POSITION                        0x7
#define _TXB0SIDH_TXB0SID10_SIZE                            0x1
#define _TXB0SIDH_TXB0SID10_LENGTH                          0x1
#define _TXB0SIDH_TXB0SID10_MASK                            0x80

