MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile __bit                   RXF11EID8           __at(0x72F0);	// @ (0xE5E * 8 + 0)
#define                                 RXF11EID8_bit       _BIT_ACCESS(RXF11EIDH,0)
// RXF11EIDH<RXF11EID9>
extern volatile __bit                   RXF11EID9           __at(0x72F1);	// @ (0xE5E * 8 + 1)
#define                                 RXF11EID9_bit       _BIT_ACCESS(RXF11EIDH,1)
// RXFCON1<RXF11EN>
extern volatile __bit                   RXF11EN             __at(0x723B);	// @ (0xE47 * 8 + 3)
#define                                 RXF11EN_bit         _BIT_ACCESS(RXFCON1,3)
// RXF11SIDL<RXF11EXIDEN>
extern volatile __bit                   RXF11EXIDEN         __at(0x72EB);	// @ (0xE5D * 8 + 3)
#define                                 RXF11EXIDEN_bit     _BIT_ACCESS(RXF11SIDL,3)
// RXF11SIDL<RXF11SID0>
extern volatile __bit                   RXF11SID0           __at(0x72ED);	// @ (0xE5D * 8 + 5)
#define                                 RXF11SID0_bit       _BIT_ACCESS(RXF11SIDL,5)
// RXF11SIDL<RXF11SID1>
extern volatile __bit                   RXF11SID1           __at(0x72EE);	// @ (0xE5D * 8 + 6)
#define                                 RXF11SID1_bit       _BIT_ACCESS(RXF11SIDL,6)
// RXF11SIDH<RXF11SID10>
extern volatile __bit                   RXF11SID10          __at(0x72E7);	// @ (0xE5C * 8 + 7)
#define                                 RXF11SID10_bit      _BIT_ACCESS(RXF11SIDH,7)
// RXF11SIDL<RXF11SID2>
extern volatile __bit                   RXF11SID2           __at(0x72EF);	// @ (0xE5D * 8 + 7)
#define                                 RXF11SID2_bit       _BIT_ACCESS(RXF11SIDL,7)
// RXF11SIDH<RXF11SID3>
extern volatile __bit                   RXF11SID3           __at(0x72E0);	// @ (0xE5C * 8 + 0)
#define                                 RXF11SID3_bit       _BIT_ACCESS(RXF11SIDH,0)
// RXF11SIDH<RXF11SID4>
extern volatile __bit                   RXF11SID4           __at(0x72E1);	// @ (0xE5C * 8 + 1)
#define                                 RXF11SID4_bit       _BIT_ACCESS(RXF11SIDH,1)
// RXF11SIDH<RXF11SID5>
extern volatile __bit                   RXF11SID5           __at(0x72E2);	// @ (0xE5C * 8 + 2)
#define                                 RXF11SID5_bit       _BIT_ACCESS(RXF11SIDH,2)
// RXF11SIDH<RXF11SID6>
extern volatile __bit                   RXF11SID6           __at(0x72E3);	// @ (0xE5C * 8 + 3)
#define                                 RXF11SID6_bit       _BIT_ACCESS(RXF11SIDH,3)
// RXF11SIDH<RXF11SID7>
extern volatile __bit                   RXF11SID7           __at(0x72E4);	// @ (0xE5C * 8 + 4)
#define                                 RXF11SID7_bit       _BIT_ACCESS(RXF11SIDH,4)
// RXF11SIDH<RXF11SID8>
extern volatile __bit                   RXF11SID8           __at(0x72E5);	// @ (0xE5C * 8 + 5)
#define                                 RXF11SID8_bit       _BIT_ACCESS(RXF11SIDH,5)
// RXF11SIDH<RXF11SID9>
extern volatile __bit                   RXF11SID9           __at(0x72E6);	// @ (0xE5C * 8 + 6)
#define                                 RXF11SID9_bit       _BIT_ACCESS(RXF11SIDH,6)
// RXF12EIDL<RXF12EID0>
extern volatile __bit                   RXF12EID0           __at(0x7318);	// @ (0xE63 * 8 + 0)
#define                                 RXF12EID0_bit       _BIT_ACCESS(RXF12EIDL,0)
// RXF12EIDL<RXF12EID1>
extern volatile __bit                   RXF12EID1           __at(0x7319);	// @ (0xE63 * 8 + 1)
#define                                 RXF12EID1_bit       _BIT_ACCESS(RXF12EIDL,1)
// RXF12EIDH<RXF12EID10>
extern volatile __bit                   RXF12EID10          __at(0x7312);	// @ (0xE62 * 8 + 2)
#define                                 RXF12EID10_bit      _BIT_ACCESS(RXF12EIDH,2)
// RXF12EIDH<RXF12EID11>
extern volatile __bit                   RXF12EID11          __at(0x7313);	// @ (0xE62 * 8 + 3)
#define                                 RXF12EID11_bit      _BIT_ACCESS(RXF12EIDH,3)
// RXF12EIDH<RXF12EID12>
extern volatile __bit                   RXF12EID12          __at(0x7314);	// @ (0xE62 * 8 + 4)
#define                                 RXF12EID12_bit      _BIT_ACCESS(RXF12EIDH,4)
// RXF12EIDH<RXF12EID13>
extern volatile __bit                   RXF12EID13          __at(0x7315);	// @ (0xE62 * 8 + 5)
#define                                 RXF12EID13_bit      _BIT_ACCESS(RXF12EIDH,5)
// RXF12EIDH<RXF12EID14>
extern volatile __bit                   RXF12EID14          __at(0x7316);	// @ (0xE62 * 8 + 6)
#define                                 RXF12EID14_bit      _BIT_ACCESS(RXF12EIDH,6)
// RXF12EIDH<RXF12EID15>
extern volatile __bit                   RXF12EID15          __at(0x7317);	// @ (0xE62 * 8 + 7)
#define                                 RXF12EID15_bit      _BIT_ACCESS(RXF12EIDH,7)
// RXF12SIDL<RXF12EID16>
extern volatile __bit                   RXF12EID16          __at(0x7308);	// @ (0xE61 * 8 + 0)
#define                                 RXF12EID16_bit      _BIT_ACCESS(RXF12SIDL,0)
// RXF12SIDL<RXF12EID17>
extern volatile __bit                   RXF12EID17          __at(0x7309);	// @ (0xE61 * 8 + 1)
#define                                 RXF12EID17_bit      _BIT_ACCESS(RXF12SIDL,1)
// RXF12EIDL<RXF12EID2>
extern volatile __bit                   RXF12EID2           __at(0x731A);	// @ (0xE63 * 8 + 2)
#define                                 RXF12EID2_bit       _BIT_ACCESS(RXF12EIDL,2)
// RXF12EIDL<RXF12EID3>
extern volatile __bit                   RXF12EID3           __at(0x731B);	// @ (0xE63 * 8 + 3)
#define                                 RXF12EID3_bit       _BIT_ACCESS(RXF12EIDL,3)
// RXF12EIDL<RXF12EID4>
extern volatile __bit                   RXF12EID4           __at(0x731C);	// @ (0xE63 * 8 + 4)
#define                                 RXF12EID4_bit       _BIT_ACCESS(RXF12EIDL,4)
// RXF12EIDL<RXF12EID5>
extern volatile __bit                   RXF12EID5           __at(0x731D);	// @ (0xE63 * 8 + 5)
#define                                 RXF12EID5_bit       _BIT_ACCESS(RXF12EIDL,5)
// RXF12EIDL<RXF12EID6>
extern volatile __bit                   RXF12EID6           __at(0x731E);	// @ (0xE63 * 8 + 6)
#define                                 RXF12EID6_bit       _BIT_ACCESS(RXF12EIDL,6)
// RXF12EIDL<RXF12EID7>
extern volatile __bit                   RXF12EID7           __at(0x731F);	// @ (0xE63 * 8 + 7)
#define                                 RXF12EID7_bit       _BIT_ACCESS(RXF12EIDL,7)
// RXF12EIDH<RXF12EID8>
extern volatile __bit                   RXF12EID8           __at(0x7310);	// @ (0xE62 * 8 + 0)
#define                                 RXF12EID8_bit       _BIT_ACCESS(RXF12EIDH,0)
// RXF12EIDH<RXF12EID9>
extern volatile __bit                   RXF12EID9           __at(0x7311);	// @ (0xE62 * 8 + 1)
#define                                 RXF12EID9_bit       _BIT_ACCESS(RXF12EIDH,1)
// RXFCON1<RXF12EN>
extern volatile __bit                   RXF12EN             __at(0x723C);	// @ (0xE47 * 8 + 4)
#define                                 RXF12EN_bit         _BIT_ACCESS(RXFCON1,4)
// RXF12SIDL<RXF12EXIDEN>
extern volatile __bit                   RXF12EXIDEN         __at(0x730B);	// @ (0xE61 * 8 + 3)
#define                                 RXF12EXIDEN_bit     _BIT_ACCESS(RXF12SIDL,3)
// RXF12SIDL<RXF12SID0>
extern volatile __bit                   RXF12SID0           __at(0x730D);	// @ (0xE61 * 8 + 5)
#define                                 RXF12SID0_bit       _BIT_ACCESS(RXF12SIDL,5)
// RXF12SIDL<RXF12SID1>
extern volatile __bit                   RXF12SID1           __at(0x730E);	// @ (0xE61 * 8 + 6)
#define                                 RXF12SID1_bit       _BIT_ACCESS(RXF12SIDL,6)
// RXF12SIDH<RXF12SID10>
extern volatile __bit                   RXF12SID10          __at(0x7307);	// @ (0xE60 * 8 + 7)
#define                                 RXF12SID10_bit      _BIT_ACCESS(RXF12SIDH,7)
// RXF12SIDL<RXF12SID2>
extern volatile __bit                   RXF12SID2           __at(0x730F);	// @ (0xE61 * 8 + 7)
#define                                 RXF12SID2_bit       _BIT_ACCESS(RXF12SIDL,7)
// RXF12SIDH<RXF12SID3>
extern volatile __bit                   RXF12SID3           __at(0x7300);	// @ (0xE60 * 8 + 0)
#define                                 RXF12SID3_bit       _BIT_ACCESS(RXF12SIDH,0)
// RXF12SIDH<RXF12SID4>
extern volatile __bit                   RXF12SID4           __at(0x7301);	// @ (0xE60 * 8 + 1)
#define                                 RXF12SID4_bit       _BIT_ACCESS(RXF12SIDH,1)
// RXF12SIDH<RXF12SID5>
extern volatile __bit                   RXF12SID5           __at(0x7302);	// @ (0xE60 * 8 + 2)
#define                                 RXF12SID5_bit       _BIT_ACCESS(RXF12SIDH,2)
// RXF12SIDH<RXF12SID6>
extern volatile __bit                   RXF12SID6           __at(0x7303);	// @ (0xE60 * 8 + 3)
#define                                 RXF12SID6_bit       _BIT_ACCESS(RXF12SIDH,3)
// RXF12SIDH<RXF12SID7>
extern volatile __bit                   RXF12SID7           __at(0x7304);	// @ (0xE60 * 8 + 4)
#define                                 RXF12SID7_bit       _BIT_ACCESS(RXF12SIDH,4)
// RXF12SIDH<RXF12SID8>
extern volatile __bit                   RXF12SID8           __at(0x7305);	// @ (0xE60 * 8 + 5)
#define                                 RXF12SID8_bit       _BIT_ACCESS(RXF12SIDH,5)
// RXF12SIDH<RXF12SID9>
extern volatile __bit                   RXF12SID9           __at(0x7306);	// @ (0xE60 * 8 + 6)
#define                                 RXF12SID9_bit       _BIT_ACCESS(RXF12SIDH,6)
// RXF13EIDL<RXF13EID0>
extern volatile __bit                   RXF13EID0           __at(0x7338);	// @ (0xE67 * 8 + 0)
#define                                 RXF13EID0_bit       _BIT_ACCESS(RXF13EIDL,0)
// RXF13EIDL<RXF13EID1>
extern volatile __bit                   RXF13EID1           __at(0x7339);	// @ (0xE67 * 8 + 1)
#define                                 RXF13EID1_bit       _BIT_ACCESS(RXF13EIDL,1)
// RXF13EIDH<RXF13EID10>
extern volatile __bit                   RXF13EID10          __at(0x7332);	// @ (0xE66 * 8 + 2)
#define                                 RXF13EID10_bit      _BIT_ACCESS(RXF13EIDH,2)
// RXF13EIDH<RXF13EID11>
extern volatile __bit                   RXF13EID11          __at(0x7333);	// @ (0xE66 * 8 + 3)
#define                                 RXF13EID11_bit      _BIT_ACCESS(RXF13EIDH,3)
// RXF13EIDH<RXF13EID12>
extern volatile __bit                   RXF13EID12          __at(0x7334);	// @ (0xE66 * 8 + 4)
#define                                 RXF13EID12_bit      _BIT_ACCESS(RXF13EIDH,4)
// RXF13EIDH<RXF13EID13>
extern volatile __bit                   RXF13EID13          __at(0x7335);	// @ (0xE66 * 8 + 5)
#define                                 RXF13EID13_bit      _BIT_ACCESS(RXF13EIDH,5)
// RXF13EIDH<RXF13EID14>
extern volatile __bit                   RXF13EID14          __at(0x7336);	// @ (0xE66 * 8 + 6)
#define                                 RXF13EID14_bit      _BIT_ACCESS(RXF13EIDH,6)
// RXF13EIDH<RXF13EID15>
extern volatile __bit                   RXF13EID15          __at(0x7337);	// @ (0xE66 * 8 + 7)
#define                                 RXF13EID15_bit      _BIT_ACCESS(RXF13EIDH,7)
// RXF13SIDL<RXF13EID16>
extern volatile __bit                   RXF13EID16          __at(0x7328);	// @ (0xE65 * 8 + 0)
#define                                 RXF13EID16_bit      _BIT_ACCESS(RXF13SIDL,0)
// RXF13SIDL<RXF13EID17>
extern volatile __bit                   RXF13EID17          __at(0x7329);	// @ (0xE65 * 8 + 1)
#define                                 RXF13EID17_bit      _BIT_ACCESS(RXF13SIDL,1)
// RXF13EIDL<RXF13EID2>
extern volatile __bit                   RXF13EID2           __at(0x733A);	// @ (0xE67 * 8 + 2)
#define                                 RXF13EID2_bit       _BIT_ACCESS(RXF13EIDL,2)
// RXF13EIDL<RXF13EID3>
extern volatile __bit                   RXF13EID3           __at(0x733B);	// @ (0xE67 * 8 + 3)
#define                                 RXF13EID3_bit       _BIT_ACCESS(RXF13EIDL,3)
// RXF13EIDL<RXF13EID4>
extern volatile __bit                   RXF13EID4           __at(0x733C);	// @ (0xE67 * 8 + 4)
#define                                 RXF13EID4_bit       _BIT_ACCESS(RXF13EIDL,4)
// RXF13EIDL<RXF13EID5>
extern volatile __bit                   RXF13EID5           __at(0x733D);	// @ (0xE67 * 8 + 5)
#define                                 RXF13EID5_bit       _BIT_ACCESS(RXF13EIDL,5)
// RXF13EIDL<RXF13EID6>
extern volatile __bit                   RXF13EID6           __at(0x733E);	// @ (0xE67 * 8 + 6)
#define                                 RXF13EID6_bit       _BIT_ACCESS(RXF13EIDL,6)
// RXF13EIDL<RXF13EID7>
extern volatile __bit                   RXF13EID7           __at(0x733F);	// @ (0xE67 * 8 + 7)
#define                                 RXF13EID7_bit       _BIT_ACCESS(RXF13EIDL,7)
// RXF13EIDH<RXF13EID8>
extern volatile __bit                   RXF13EID8           __at(0x7330);	// @ (0xE66 * 8 + 0)
#define                                 RXF13EID8_bit       _BIT_ACCESS(RXF13EIDH,0)
// RXF13EIDH<RXF13EID9>
extern volatile __bit                   RXF13EID9           __at(0x7331);	// @ (0xE66 * 8 + 1)
#define                                 RXF13EID9_bit       _BIT_ACCESS(RXF13EIDH,1)
// RXFCON1<RXF13EN>
extern volatile __bit                   RXF13EN             __at(0x723D);	// @ (0xE47 * 8 + 5)
#define                                 RXF13EN_bit         _BIT_ACCESS(RXFCON1,5)
// RXF13SIDL<RXF13EXIDEN>
extern volatile __bit                   RXF13EXIDEN         __at(0x732B);	// @ (0xE65 * 8 + 3)
#define                                 RXF13EXIDEN_bit     _BIT_ACCESS(RXF13SIDL,3)
// RXF13SIDL<RXF13SID0>
extern volatile __bit                   RXF13SID0           __at(0x732D);	// @ (0xE65 * 8 + 5)
#define                                 RXF13SID0_bit       _BIT_ACCESS(RXF13SIDL,5)
// RXF13SIDL<RXF13SID1>
extern volatile __bit                   RXF13SID1           __at(0x732E);	// @ (0xE65 * 8 + 6)
#define                                 RXF13SID1_bit       _BIT_ACCESS(RXF13SIDL,6)
// RXF13SIDH<RXF13SID10>
extern volatile __bit                   RXF13SID10          __at(0x7327);	// @ (0xE64 * 8 + 7)
#define                                 RXF13SID10_bit      _BIT_ACCESS(RXF13SIDH,7)
// RXF13SIDL<RXF13SID2>
extern volatile __bit                   RXF13SID2           __at(0x732F);	// @ (0xE65 * 8 + 7)
#define                                 RXF13SID2_bit       _BIT_ACCESS(RXF13SIDL,7)
// RXF13SIDH<RXF13SID3>
extern volatile __bit                   RXF13SID3           __at(0x7320);	// @ (0xE64 * 8 + 0)
#define                                 RXF13SID3_bit       _BIT_ACCESS(RXF13SIDH,0)
// RXF13SIDH<RXF13SID4>
extern volatile __bit                   RXF13SID4           __at(0x7321);	// @ (0xE64 * 8 + 1)
#define                                 RXF13SID4_bit       _BIT_ACCESS(RXF13SIDH,1)
// RXF13SIDH<RXF13SID5>
extern volatile __bit                   RXF13SID5           __at(0x7322);	// @ (0xE64 * 8 + 2)
#define                                 RXF13SID5_bit       _BIT_ACCESS(RXF13SIDH,2)
// RXF13SIDH<RXF13SID6>
extern volatile __bit                   RXF13SID6           __at(0x7323);	// @ (0xE64 * 8 + 3)
#define                                 RXF13SID6_bit       _BIT_ACCESS(RXF13SIDH,3)
// RXF13SIDH<RXF13SID7>
extern volatile __bit                   RXF13SID7           __at(0x7324);	// @ (0xE64 * 8 + 4)
#define                                 RXF13SID7_bit       _BIT_ACCESS(RXF13SIDH,4)
// RXF13SIDH<RXF13SID8>
extern volatile __bit                   RXF13SID8           __at(0x7325);	// @ (0xE64 * 8 + 5)
#define                                 RXF13SID8_bit       _BIT_ACCESS(RXF13SIDH,5)
// RXF13SIDH<RXF13SID9>
extern volatile __bit                   RXF13SID9           __at(0x7326);	// @ (0xE64 * 8 + 6)
#define                                 RXF13SID9_bit       _BIT_ACCESS(RXF13SIDH,6)
// RXF14EIDL<RXF14EID0>
extern volatile __bit                   RXF14EID0           __at(0x7358);	// @ (0xE6B * 8 + 0)
#define                                 RXF14EID0_bit       _BIT_ACCESS(RXF14EIDL,0)
// RXF14EIDL<RXF14EID1>
extern volatile __bit                   RXF14EID1           __at(0x7359);	// @ (0xE6B * 8 + 1)
#define                                 RXF14EID1_bit       _BIT_ACCESS(RXF14EIDL,1)
// RXF14EIDH<RXF14EID10>
extern volatile __bit                   RXF14EID10          __at(0x7352);	// @ (0xE6A * 8 + 2)
#define                                 RXF14EID10_bit      _BIT_ACCESS(RXF14EIDH,2)
// RXF14EIDH<RXF14EID11>
extern volatile __bit                   RXF14EID11          __at(0x7353);	// @ (0xE6A * 8 + 3)
#define                                 RXF14EID11_bit      _BIT_ACCESS(RXF14EIDH,3)
// RXF14EIDH<RXF14EID12>
extern volatile __bit                   RXF14EID12          __at(0x7354);	// @ (0xE6A * 8 + 4)
#define                                 RXF14EID12_bit      _BIT_ACCESS(RXF14EIDH,4)
// RXF14EIDH<RXF14EID13>
extern volatile __bit                   RXF14EID13          __at(0x7355);	// @ (0xE6A * 8 + 5)
#define                                 RXF14EID13_bit      _BIT_ACCESS(RXF14EIDH,5)
// RXF14EIDH<RXF14EID14>
extern volatile __bit                   RXF14EID14          __at(0x7356);	// @ (0xE6A * 8 + 6)
#define                                 RXF14EID14_bit      _BIT_ACCESS(RXF14EIDH,6)
// RXF14EIDH<RXF14EID15>
extern volatile __bit                   RXF14EID15          __at(0x7357);	// @ (0xE6A * 8 + 7)
#define                                 RXF14EID15_bit      _BIT_ACCESS(RXF14EIDH,7)
// RXF14SIDL<RXF14EID16>
extern volatile __bit                   RXF14EID16          __at(0x7348);	// @ (0xE69 * 8 + 0)
#define                                 RXF14EID16_bit      _BIT_ACCESS(RXF14SIDL,0)
// RXF14SIDL<RXF14EID17>
extern volatile __bit                   RXF14EID17          __at(0x7349);	// @ (0xE69 * 8 + 1)
#define                                 RXF14EID17_bit      _BIT_ACCESS(RXF14SIDL,1)
// RXF14EIDL<RXF14EID2>
extern volatile __bit                   RXF14EID2           __at(0x735A);	// @ (0xE6B * 8 + 2)
#define                                 RXF14EID2_bit       _BIT_ACCESS(RXF14EIDL,2)
// RXF14EIDL<RXF14EID3>
extern volatile __bit                   RXF14EID3           __at(0x735B);	// @ (0xE6B * 8 + 3)
#define                                 RXF14EID3_bit       _BIT_ACCESS(RXF14EIDL,3)
// RXF14EIDL<RXF14EID4>
extern volatile __bit                   RXF14EID4           __at(0x735C);	// @ (0xE6B * 8 + 4)
#define                                 RXF14EID4_bit       _BIT_ACCESS(RXF14EIDL,4)
// RXF14EIDL<RXF14EID5>
extern volatile __bit                   RXF14EID5           __at(0x735D);	// @ (0xE6B * 8 + 5)
#define                                 RXF14EID5_bit       _BIT_ACCESS(RXF14EIDL,5)
// RXF14EIDL<RXF14EID6>
extern volatile __bit                   RXF14EID6           __at(0x735E);	// @ (0xE6B * 8 + 6)
#define                                 RXF14EID6_bit       _BIT_ACCESS(RXF14EIDL,6)
// RXF14EIDL<RXF14EID7>
extern volatile __bit                   RXF14EID7           __at(0x735F);	// @ (0xE6B * 8 + 7)
#define                                 RXF14EID7_bit       _BIT_ACCESS(RXF14EIDL,7)
// RXF14EIDH<RXF14EID8>
extern volatile __bit                   RXF14EID8           __at(0x7350);	// @ (0xE6A * 8 + 0)
#define                                 RXF14EID8_bit       _BIT_ACCESS(RXF14EIDH,0)
// RXF14EIDH<RXF14EID9>
extern volatile __bit                   RXF14EID9           __at(0x7351);	// @ (0xE6A * 8 + 1)
#define                                 RXF14EID9_bit       _BIT_ACCESS(RXF14EIDH,1)
// RXFCON1<RXF14EN>
extern volatile __bit                   RXF14EN             __at(0x723E);	// @ (0xE47 * 8 + 6)
#define                                 RXF14EN_bit         _BIT_ACCESS(RXFCON1,6)
// RXF14SIDL<RXF14EXIDEN>
extern volatile __bit                   RXF14EXIDEN         __at(0x734B);	// @ (0xE69 * 8 + 3)
#define                                 RXF14EXIDEN_bit     _BIT_ACCESS(RXF14SIDL,3)
// RXF14SIDL<RXF14SID0>
extern volatile __bit                   RXF14SID0           __at(0x734D);	// @ (0xE69 * 8 + 5)
#define                                 RXF14SID0_bit       _BIT_ACCESS(RXF14SIDL,5)
// RXF14SIDL<RXF14SID1>
extern volatile __bit                   RXF14SID1           __at(0x734E);	// @ (0xE69 * 8 + 6)
#define                                 RXF14SID1_bit       _BIT_ACCESS(RXF14SIDL,6)
// RXF14SIDH<RXF14SID10>
extern volatile __bit                   RXF14SID10          __at(0x7347);	// @ (0xE68 * 8 + 7)
#define                                 RXF14SID10_bit      _BIT_ACCESS(RXF14SIDH,7)
// RXF14SIDL<RXF14SID2>
extern volatile __bit                   RXF14SID2           __at(0x734F);	// @ (0xE69 * 8 + 7)
#define                                 RXF14SID2_bit       _BIT_ACCESS(RXF14SIDL,7)
// RXF14SIDH<RXF14SID3>
extern volatile __bit                   RXF14SID3           __at(0x7340);	// @ (0xE68 * 8 + 0)
#define                                 RXF14SID3_bit       _BIT_ACCESS(RXF14SIDH,0)
// RXF14SIDH<RXF14SID4>
extern volatile __bit                   RXF14SID4           __at(0x7341);	// @ (0xE68 * 8 + 1)
#define                                 RXF14SID4_bit       _BIT_ACCESS(RXF14SIDH,1)
// RXF14SIDH<RXF14SID5>
extern volatile __bit                   RXF14SID5           __at(0x7342);	// @ (0xE68 * 8 + 2)
#define                                 RXF14SID5_bit       _BIT_ACCESS(RXF14SIDH,2)
// RXF14SIDH<RXF14SID6>
extern volatile __bit                   RXF14SID6           __at(0x7343);	// @ (0xE68 * 8 + 3)
#define                                 RXF14SID6_bit       _BIT_ACCESS(RXF14SIDH,3)
// RXF14SIDH<RXF14SID7>
extern volatile __bit                   RXF14SID7           __at(0x7344);	// @ (0xE68 * 8 + 4)
#define                                 RXF14SID7_bit       _BIT_ACCESS(RXF14SIDH,4)
// RXF14SIDH<RXF14SID8>
extern volatile __bit                   RXF14SID8           __at(0x7345);	// @ (0xE68 * 8 + 5)
#define                                 RXF14SID8_bit       _BIT_ACCESS(RXF14SIDH,5)
// RXF14SIDH<RXF14SID9>
extern volatile __bit                   RXF14SID9           __at(0x7346);	// @ (0xE68 * 8 + 6)
#define                                 RXF14SID9_bit       _BIT_ACCESS(RXF14SIDH,6)
// RXF15EIDL<RXF15EID0>
extern volatile __bit                   RXF15EID0           __at(0x7378);	// @ (0xE6F * 8 + 0)
#define                                 RXF15EID0_bit       _BIT_ACCESS(RXF15EIDL,0)
// RXF15EIDL<RXF15EID1>
extern volatile __bit                   RXF15EID1           __at(0x7379);	// @ (0xE6F * 8 + 1)
#define                                 RXF15EID1_bit       _BIT_ACCESS(RXF15EIDL,1)
// RXF15EIDH<RXF15EID10>
extern volatile __bit                   RXF15EID10          __at(0x7372);	// @ (0xE6E * 8 + 2)
#define                                 RXF15EID10_bit      _BIT_ACCESS(RXF15EIDH,2)
// RXF15EIDH<RXF15EID11>
extern volatile __bit                   RXF15EID11          __at(0x7373);	// @ (0xE6E * 8 + 3)
#define                                 RXF15EID11_bit      _BIT_ACCESS(RXF15EIDH,3)
// RXF15EIDH<RXF15EID12>
extern volatile __bit                   RXF15EID12          __at(0x7374);	// @ (0xE6E * 8 + 4)
#define                                 RXF15EID12_bit      _BIT_ACCESS(RXF15EIDH,4)
// RXF15EIDH<RXF15EID13>
extern volatile __bit                   RXF15EID13          __at(0x7375);	// @ (0xE6E * 8 + 5)
#define                                 RXF15EID13_bit      _BIT_ACCESS(RXF15EIDH,5)
// RXF15EIDH<RXF15EID14>
extern volatile __bit                   RXF15EID14          __at(0x7376);	// @ (0xE6E * 8 + 6)
#define                                 RXF15EID14_bit      _BIT_ACCESS(RXF15EIDH,6)
// RXF15EIDH<RXF15EID15>
extern volatile __bit                   RXF15EID15          __at(0x7377);	// @ (0xE6E * 8 + 7)
#define                                 RXF15EID15_bit      _BIT_ACCESS(RXF15EIDH,7)
// RXF15SIDL<RXF15EID16>
extern volatile __bit                   RXF15EID16          __at(0x7368);	// @ (0xE6D * 8 + 0)
#define                                 RXF15EID16_bit      _BIT_ACCESS(RXF15SIDL,0)
// RXF15SIDL<RXF15EID17>
extern volatile __bit                   RXF15EID17          __at(0x7369);	// @ (0xE6D * 8 + 1)
