MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K80/mcu.h
extern volatile __bit                   RXF4EID12           __at(0x7794);	// @ (0xEF2 * 8 + 4)
#define                                 RXF4EID12_bit       _BIT_ACCESS(RXF4EIDH,4)
// RXF4EIDH<RXF4EID13>
extern volatile __bit                   RXF4EID13           __at(0x7795);	// @ (0xEF2 * 8 + 5)
#define                                 RXF4EID13_bit       _BIT_ACCESS(RXF4EIDH,5)
// RXF4EIDH<RXF4EID14>
extern volatile __bit                   RXF4EID14           __at(0x7796);	// @ (0xEF2 * 8 + 6)
#define                                 RXF4EID14_bit       _BIT_ACCESS(RXF4EIDH,6)
// RXF4EIDH<RXF4EID15>
extern volatile __bit                   RXF4EID15           __at(0x7797);	// @ (0xEF2 * 8 + 7)
#define                                 RXF4EID15_bit       _BIT_ACCESS(RXF4EIDH,7)
// RXF4SIDL<RXF4EID16>
extern volatile __bit                   RXF4EID16           __at(0x7788);	// @ (0xEF1 * 8 + 0)
#define                                 RXF4EID16_bit       _BIT_ACCESS(RXF4SIDL,0)
// RXF4SIDL<RXF4EID17>
extern volatile __bit                   RXF4EID17           __at(0x7789);	// @ (0xEF1 * 8 + 1)
#define                                 RXF4EID17_bit       _BIT_ACCESS(RXF4SIDL,1)
// RXF4EIDL<RXF4EID2>
extern volatile __bit                   RXF4EID2            __at(0x779A);	// @ (0xEF3 * 8 + 2)
#define                                 RXF4EID2_bit        _BIT_ACCESS(RXF4EIDL,2)
// RXF4EIDL<RXF4EID3>
extern volatile __bit                   RXF4EID3            __at(0x779B);	// @ (0xEF3 * 8 + 3)
#define                                 RXF4EID3_bit        _BIT_ACCESS(RXF4EIDL,3)
// RXF4EIDL<RXF4EID4>
extern volatile __bit                   RXF4EID4            __at(0x779C);	// @ (0xEF3 * 8 + 4)
#define                                 RXF4EID4_bit        _BIT_ACCESS(RXF4EIDL,4)
// RXF4EIDL<RXF4EID5>
extern volatile __bit                   RXF4EID5            __at(0x779D);	// @ (0xEF3 * 8 + 5)
#define                                 RXF4EID5_bit        _BIT_ACCESS(RXF4EIDL,5)
// RXF4EIDL<RXF4EID6>
extern volatile __bit                   RXF4EID6            __at(0x779E);	// @ (0xEF3 * 8 + 6)
#define                                 RXF4EID6_bit        _BIT_ACCESS(RXF4EIDL,6)
// RXF4EIDL<RXF4EID7>
extern volatile __bit                   RXF4EID7            __at(0x779F);	// @ (0xEF3 * 8 + 7)
#define                                 RXF4EID7_bit        _BIT_ACCESS(RXF4EIDL,7)
// RXF4EIDH<RXF4EID8>
extern volatile __bit                   RXF4EID8            __at(0x7790);	// @ (0xEF2 * 8 + 0)
#define                                 RXF4EID8_bit        _BIT_ACCESS(RXF4EIDH,0)
// RXF4EIDH<RXF4EID9>
extern volatile __bit                   RXF4EID9            __at(0x7791);	// @ (0xEF2 * 8 + 1)
#define                                 RXF4EID9_bit        _BIT_ACCESS(RXF4EIDH,1)
// RXFCON0<RXF4EN>
extern volatile __bit                   RXF4EN              __at(0x7234);	// @ (0xE46 * 8 + 4)
#define                                 RXF4EN_bit          _BIT_ACCESS(RXFCON0,4)
// RXF4SIDL<RXF4EXIDEN>
extern volatile __bit                   RXF4EXIDEN          __at(0x778B);	// @ (0xEF1 * 8 + 3)
#define                                 RXF4EXIDEN_bit      _BIT_ACCESS(RXF4SIDL,3)
// RXF4SIDL<RXF4SID0>
extern volatile __bit                   RXF4SID0            __at(0x778D);	// @ (0xEF1 * 8 + 5)
#define                                 RXF4SID0_bit        _BIT_ACCESS(RXF4SIDL,5)
// RXF4SIDL<RXF4SID1>
extern volatile __bit                   RXF4SID1            __at(0x778E);	// @ (0xEF1 * 8 + 6)
#define                                 RXF4SID1_bit        _BIT_ACCESS(RXF4SIDL,6)
// RXF4SIDH<RXF4SID10>
extern volatile __bit                   RXF4SID10           __at(0x7787);	// @ (0xEF0 * 8 + 7)
#define                                 RXF4SID10_bit       _BIT_ACCESS(RXF4SIDH,7)
// RXF4SIDL<RXF4SID2>
extern volatile __bit                   RXF4SID2            __at(0x778F);	// @ (0xEF1 * 8 + 7)
#define                                 RXF4SID2_bit        _BIT_ACCESS(RXF4SIDL,7)
// RXF4SIDH<RXF4SID3>
extern volatile __bit                   RXF4SID3            __at(0x7780);	// @ (0xEF0 * 8 + 0)
#define                                 RXF4SID3_bit        _BIT_ACCESS(RXF4SIDH,0)
// RXF4SIDH<RXF4SID4>
extern volatile __bit                   RXF4SID4            __at(0x7781);	// @ (0xEF0 * 8 + 1)
#define                                 RXF4SID4_bit        _BIT_ACCESS(RXF4SIDH,1)
// RXF4SIDH<RXF4SID5>
extern volatile __bit                   RXF4SID5            __at(0x7782);	// @ (0xEF0 * 8 + 2)
#define                                 RXF4SID5_bit        _BIT_ACCESS(RXF4SIDH,2)
// RXF4SIDH<RXF4SID6>
extern volatile __bit                   RXF4SID6            __at(0x7783);	// @ (0xEF0 * 8 + 3)
#define                                 RXF4SID6_bit        _BIT_ACCESS(RXF4SIDH,3)
// RXF4SIDH<RXF4SID7>
extern volatile __bit                   RXF4SID7            __at(0x7784);	// @ (0xEF0 * 8 + 4)
#define                                 RXF4SID7_bit        _BIT_ACCESS(RXF4SIDH,4)
// RXF4SIDH<RXF4SID8>
extern volatile __bit                   RXF4SID8            __at(0x7785);	// @ (0xEF0 * 8 + 5)
#define                                 RXF4SID8_bit        _BIT_ACCESS(RXF4SIDH,5)
// RXF4SIDH<RXF4SID9>
extern volatile __bit                   RXF4SID9            __at(0x7786);	// @ (0xEF0 * 8 + 6)
#define                                 RXF4SID9_bit        _BIT_ACCESS(RXF4SIDH,6)
// RXF5EIDL<RXF5EID0>
extern volatile __bit                   RXF5EID0            __at(0x77B8);	// @ (0xEF7 * 8 + 0)
#define                                 RXF5EID0_bit        _BIT_ACCESS(RXF5EIDL,0)
// RXF5EIDL<RXF5EID1>
extern volatile __bit                   RXF5EID1            __at(0x77B9);	// @ (0xEF7 * 8 + 1)
#define                                 RXF5EID1_bit        _BIT_ACCESS(RXF5EIDL,1)
// RXF5EIDH<RXF5EID10>
extern volatile __bit                   RXF5EID10           __at(0x77B2);	// @ (0xEF6 * 8 + 2)
#define                                 RXF5EID10_bit       _BIT_ACCESS(RXF5EIDH,2)
// RXF5EIDH<RXF5EID11>
extern volatile __bit                   RXF5EID11           __at(0x77B3);	// @ (0xEF6 * 8 + 3)
#define                                 RXF5EID11_bit       _BIT_ACCESS(RXF5EIDH,3)
// RXF5EIDH<RXF5EID12>
extern volatile __bit                   RXF5EID12           __at(0x77B4);	// @ (0xEF6 * 8 + 4)
#define                                 RXF5EID12_bit       _BIT_ACCESS(RXF5EIDH,4)
// RXF5EIDH<RXF5EID13>
extern volatile __bit                   RXF5EID13           __at(0x77B5);	// @ (0xEF6 * 8 + 5)
#define                                 RXF5EID13_bit       _BIT_ACCESS(RXF5EIDH,5)
// RXF5EIDH<RXF5EID14>
extern volatile __bit                   RXF5EID14           __at(0x77B6);	// @ (0xEF6 * 8 + 6)
#define                                 RXF5EID14_bit       _BIT_ACCESS(RXF5EIDH,6)
// RXF5EIDH<RXF5EID15>
extern volatile __bit                   RXF5EID15           __at(0x77B7);	// @ (0xEF6 * 8 + 7)
#define                                 RXF5EID15_bit       _BIT_ACCESS(RXF5EIDH,7)
// RXF5SIDL<RXF5EID16>
extern volatile __bit                   RXF5EID16           __at(0x77A8);	// @ (0xEF5 * 8 + 0)
#define                                 RXF5EID16_bit       _BIT_ACCESS(RXF5SIDL,0)
// RXF5SIDL<RXF5EID17>
extern volatile __bit                   RXF5EID17           __at(0x77A9);	// @ (0xEF5 * 8 + 1)
#define                                 RXF5EID17_bit       _BIT_ACCESS(RXF5SIDL,1)
// RXF5EIDL<RXF5EID2>
extern volatile __bit                   RXF5EID2            __at(0x77BA);	// @ (0xEF7 * 8 + 2)
#define                                 RXF5EID2_bit        _BIT_ACCESS(RXF5EIDL,2)
// RXF5EIDL<RXF5EID3>
extern volatile __bit                   RXF5EID3            __at(0x77BB);	// @ (0xEF7 * 8 + 3)
#define                                 RXF5EID3_bit        _BIT_ACCESS(RXF5EIDL,3)
// RXF5EIDL<RXF5EID4>
extern volatile __bit                   RXF5EID4            __at(0x77BC);	// @ (0xEF7 * 8 + 4)
#define                                 RXF5EID4_bit        _BIT_ACCESS(RXF5EIDL,4)
// RXF5EIDL<RXF5EID5>
extern volatile __bit                   RXF5EID5            __at(0x77BD);	// @ (0xEF7 * 8 + 5)
#define                                 RXF5EID5_bit        _BIT_ACCESS(RXF5EIDL,5)
// RXF5EIDL<RXF5EID6>
extern volatile __bit                   RXF5EID6            __at(0x77BE);	// @ (0xEF7 * 8 + 6)
#define                                 RXF5EID6_bit        _BIT_ACCESS(RXF5EIDL,6)
// RXF5EIDL<RXF5EID7>
extern volatile __bit                   RXF5EID7            __at(0x77BF);	// @ (0xEF7 * 8 + 7)
#define                                 RXF5EID7_bit        _BIT_ACCESS(RXF5EIDL,7)
// RXF5EIDH<RXF5EID8>
extern volatile __bit                   RXF5EID8            __at(0x77B0);	// @ (0xEF6 * 8 + 0)
#define                                 RXF5EID8_bit        _BIT_ACCESS(RXF5EIDH,0)
// RXF5EIDH<RXF5EID9>
extern volatile __bit                   RXF5EID9            __at(0x77B1);	// @ (0xEF6 * 8 + 1)
#define                                 RXF5EID9_bit        _BIT_ACCESS(RXF5EIDH,1)
// RXFCON0<RXF5EN>
extern volatile __bit                   RXF5EN              __at(0x7235);	// @ (0xE46 * 8 + 5)
#define                                 RXF5EN_bit          _BIT_ACCESS(RXFCON0,5)
// RXF5SIDL<RXF5EXIDEN>
extern volatile __bit                   RXF5EXIDEN          __at(0x77AB);	// @ (0xEF5 * 8 + 3)
#define                                 RXF5EXIDEN_bit      _BIT_ACCESS(RXF5SIDL,3)
// RXF5SIDL<RXF5SID0>
extern volatile __bit                   RXF5SID0            __at(0x77AD);	// @ (0xEF5 * 8 + 5)
#define                                 RXF5SID0_bit        _BIT_ACCESS(RXF5SIDL,5)
// RXF5SIDL<RXF5SID1>
extern volatile __bit                   RXF5SID1            __at(0x77AE);	// @ (0xEF5 * 8 + 6)
#define                                 RXF5SID1_bit        _BIT_ACCESS(RXF5SIDL,6)
// RXF5SIDH<RXF5SID10>
extern volatile __bit                   RXF5SID10           __at(0x77A7);	// @ (0xEF4 * 8 + 7)
#define                                 RXF5SID10_bit       _BIT_ACCESS(RXF5SIDH,7)
// RXF5SIDL<RXF5SID2>
extern volatile __bit                   RXF5SID2            __at(0x77AF);	// @ (0xEF5 * 8 + 7)
#define                                 RXF5SID2_bit        _BIT_ACCESS(RXF5SIDL,7)
// RXF5SIDH<RXF5SID3>
extern volatile __bit                   RXF5SID3            __at(0x77A0);	// @ (0xEF4 * 8 + 0)
#define                                 RXF5SID3_bit        _BIT_ACCESS(RXF5SIDH,0)
// RXF5SIDH<RXF5SID4>
extern volatile __bit                   RXF5SID4            __at(0x77A1);	// @ (0xEF4 * 8 + 1)
#define                                 RXF5SID4_bit        _BIT_ACCESS(RXF5SIDH,1)
// RXF5SIDH<RXF5SID5>
extern volatile __bit                   RXF5SID5            __at(0x77A2);	// @ (0xEF4 * 8 + 2)
#define                                 RXF5SID5_bit        _BIT_ACCESS(RXF5SIDH,2)
// RXF5SIDH<RXF5SID6>
extern volatile __bit                   RXF5SID6            __at(0x77A3);	// @ (0xEF4 * 8 + 3)
#define                                 RXF5SID6_bit        _BIT_ACCESS(RXF5SIDH,3)
// RXF5SIDH<RXF5SID7>
extern volatile __bit                   RXF5SID7            __at(0x77A4);	// @ (0xEF4 * 8 + 4)
#define                                 RXF5SID7_bit        _BIT_ACCESS(RXF5SIDH,4)
// RXF5SIDH<RXF5SID8>
extern volatile __bit                   RXF5SID8            __at(0x77A5);	// @ (0xEF4 * 8 + 5)
#define                                 RXF5SID8_bit        _BIT_ACCESS(RXF5SIDH,5)
// RXF5SIDH<RXF5SID9>
extern volatile __bit                   RXF5SID9            __at(0x77A6);	// @ (0xEF4 * 8 + 6)
#define                                 RXF5SID9_bit        _BIT_ACCESS(RXF5SIDH,6)
// RXF6EIDL<RXF6EID0>
extern volatile __bit                   RXF6EID0            __at(0x7258);	// @ (0xE4B * 8 + 0)
#define                                 RXF6EID0_bit        _BIT_ACCESS(RXF6EIDL,0)
// RXF6EIDL<RXF6EID1>
extern volatile __bit                   RXF6EID1            __at(0x7259);	// @ (0xE4B * 8 + 1)
#define                                 RXF6EID1_bit        _BIT_ACCESS(RXF6EIDL,1)
// RXF6EIDH<RXF6EID10>
extern volatile __bit                   RXF6EID10           __at(0x7252);	// @ (0xE4A * 8 + 2)
#define                                 RXF6EID10_bit       _BIT_ACCESS(RXF6EIDH,2)
// RXF6EIDH<RXF6EID11>
extern volatile __bit                   RXF6EID11           __at(0x7253);	// @ (0xE4A * 8 + 3)
#define                                 RXF6EID11_bit       _BIT_ACCESS(RXF6EIDH,3)
// RXF6EIDH<RXF6EID12>
extern volatile __bit                   RXF6EID12           __at(0x7254);	// @ (0xE4A * 8 + 4)
#define                                 RXF6EID12_bit       _BIT_ACCESS(RXF6EIDH,4)
// RXF6EIDH<RXF6EID13>
extern volatile __bit                   RXF6EID13           __at(0x7255);	// @ (0xE4A * 8 + 5)
#define                                 RXF6EID13_bit       _BIT_ACCESS(RXF6EIDH,5)
// RXF6EIDH<RXF6EID14>
extern volatile __bit                   RXF6EID14           __at(0x7256);	// @ (0xE4A * 8 + 6)
#define                                 RXF6EID14_bit       _BIT_ACCESS(RXF6EIDH,6)
// RXF6EIDH<RXF6EID15>
extern volatile __bit                   RXF6EID15           __at(0x7257);	// @ (0xE4A * 8 + 7)
#define                                 RXF6EID15_bit       _BIT_ACCESS(RXF6EIDH,7)
// RXF6SIDL<RXF6EID16>
extern volatile __bit                   RXF6EID16           __at(0x7248);	// @ (0xE49 * 8 + 0)
#define                                 RXF6EID16_bit       _BIT_ACCESS(RXF6SIDL,0)
// RXF6SIDL<RXF6EID17>
extern volatile __bit                   RXF6EID17           __at(0x7249);	// @ (0xE49 * 8 + 1)
#define                                 RXF6EID17_bit       _BIT_ACCESS(RXF6SIDL,1)
// RXF6EIDL<RXF6EID2>
extern volatile __bit                   RXF6EID2            __at(0x725A);	// @ (0xE4B * 8 + 2)
#define                                 RXF6EID2_bit        _BIT_ACCESS(RXF6EIDL,2)
// RXF6EIDL<RXF6EID3>
extern volatile __bit                   RXF6EID3            __at(0x725B);	// @ (0xE4B * 8 + 3)
#define                                 RXF6EID3_bit        _BIT_ACCESS(RXF6EIDL,3)
// RXF6EIDL<RXF6EID4>
extern volatile __bit                   RXF6EID4            __at(0x725C);	// @ (0xE4B * 8 + 4)
#define                                 RXF6EID4_bit        _BIT_ACCESS(RXF6EIDL,4)
// RXF6EIDL<RXF6EID5>
extern volatile __bit                   RXF6EID5            __at(0x725D);	// @ (0xE4B * 8 + 5)
#define                                 RXF6EID5_bit        _BIT_ACCESS(RXF6EIDL,5)
// RXF6EIDL<RXF6EID6>
extern volatile __bit                   RXF6EID6            __at(0x725E);	// @ (0xE4B * 8 + 6)
#define                                 RXF6EID6_bit        _BIT_ACCESS(RXF6EIDL,6)
// RXF6EIDL<RXF6EID7>
extern volatile __bit                   RXF6EID7            __at(0x725F);	// @ (0xE4B * 8 + 7)
#define                                 RXF6EID7_bit        _BIT_ACCESS(RXF6EIDL,7)
// RXF6EIDH<RXF6EID8>
extern volatile __bit                   RXF6EID8            __at(0x7250);	// @ (0xE4A * 8 + 0)
#define                                 RXF6EID8_bit        _BIT_ACCESS(RXF6EIDH,0)
// RXF6EIDH<RXF6EID9>
extern volatile __bit                   RXF6EID9            __at(0x7251);	// @ (0xE4A * 8 + 1)
#define                                 RXF6EID9_bit        _BIT_ACCESS(RXF6EIDH,1)
// RXFCON0<RXF6EN>
extern volatile __bit                   RXF6EN              __at(0x7236);	// @ (0xE46 * 8 + 6)
#define                                 RXF6EN_bit          _BIT_ACCESS(RXFCON0,6)
// RXF6SIDL<RXF6EXIDEN>
extern volatile __bit                   RXF6EXIDEN          __at(0x724B);	// @ (0xE49 * 8 + 3)
#define                                 RXF6EXIDEN_bit      _BIT_ACCESS(RXF6SIDL,3)
// RXF6SIDL<RXF6SID0>
extern volatile __bit                   RXF6SID0            __at(0x724D);	// @ (0xE49 * 8 + 5)
#define                                 RXF6SID0_bit        _BIT_ACCESS(RXF6SIDL,5)
// RXF6SIDL<RXF6SID1>
extern volatile __bit                   RXF6SID1            __at(0x724E);	// @ (0xE49 * 8 + 6)
#define                                 RXF6SID1_bit        _BIT_ACCESS(RXF6SIDL,6)
// RXF6SIDH<RXF6SID10>
extern volatile __bit                   RXF6SID10           __at(0x7247);	// @ (0xE48 * 8 + 7)
#define                                 RXF6SID10_bit       _BIT_ACCESS(RXF6SIDH,7)
// RXF6SIDL<RXF6SID2>
extern volatile __bit                   RXF6SID2            __at(0x724F);	// @ (0xE49 * 8 + 7)
#define                                 RXF6SID2_bit        _BIT_ACCESS(RXF6SIDL,7)
// RXF6SIDH<RXF6SID3>
extern volatile __bit                   RXF6SID3            __at(0x7240);	// @ (0xE48 * 8 + 0)
#define                                 RXF6SID3_bit        _BIT_ACCESS(RXF6SIDH,0)
// RXF6SIDH<RXF6SID4>
extern volatile __bit                   RXF6SID4            __at(0x7241);	// @ (0xE48 * 8 + 1)
#define                                 RXF6SID4_bit        _BIT_ACCESS(RXF6SIDH,1)
// RXF6SIDH<RXF6SID5>
extern volatile __bit                   RXF6SID5            __at(0x7242);	// @ (0xE48 * 8 + 2)
#define                                 RXF6SID5_bit        _BIT_ACCESS(RXF6SIDH,2)
// RXF6SIDH<RXF6SID6>
extern volatile __bit                   RXF6SID6            __at(0x7243);	// @ (0xE48 * 8 + 3)
#define                                 RXF6SID6_bit        _BIT_ACCESS(RXF6SIDH,3)
// RXF6SIDH<RXF6SID7>
extern volatile __bit                   RXF6SID7            __at(0x7244);	// @ (0xE48 * 8 + 4)
#define                                 RXF6SID7_bit        _BIT_ACCESS(RXF6SIDH,4)
// RXF6SIDH<RXF6SID8>
extern volatile __bit                   RXF6SID8            __at(0x7245);	// @ (0xE48 * 8 + 5)
#define                                 RXF6SID8_bit        _BIT_ACCESS(RXF6SIDH,5)
// RXF6SIDH<RXF6SID9>
extern volatile __bit                   RXF6SID9            __at(0x7246);	// @ (0xE48 * 8 + 6)
#define                                 RXF6SID9_bit        _BIT_ACCESS(RXF6SIDH,6)
// RXF7EIDL<RXF7EID0>
extern volatile __bit                   RXF7EID0            __at(0x7278);	// @ (0xE4F * 8 + 0)
#define                                 RXF7EID0_bit        _BIT_ACCESS(RXF7EIDL,0)
// RXF7EIDL<RXF7EID1>
extern volatile __bit                   RXF7EID1            __at(0x7279);	// @ (0xE4F * 8 + 1)
#define                                 RXF7EID1_bit        _BIT_ACCESS(RXF7EIDL,1)
// RXF7EIDH<RXF7EID10>
extern volatile __bit                   RXF7EID10           __at(0x7272);	// @ (0xE4E * 8 + 2)
#define                                 RXF7EID10_bit       _BIT_ACCESS(RXF7EIDH,2)
// RXF7EIDH<RXF7EID11>
extern volatile __bit                   RXF7EID11           __at(0x7273);	// @ (0xE4E * 8 + 3)
#define                                 RXF7EID11_bit       _BIT_ACCESS(RXF7EIDH,3)
// RXF7EIDH<RXF7EID12>
extern volatile __bit                   RXF7EID12           __at(0x7274);	// @ (0xE4E * 8 + 4)
#define                                 RXF7EID12_bit       _BIT_ACCESS(RXF7EIDH,4)
// RXF7EIDH<RXF7EID13>
extern volatile __bit                   RXF7EID13           __at(0x7275);	// @ (0xE4E * 8 + 5)
#define                                 RXF7EID13_bit       _BIT_ACCESS(RXF7EIDH,5)
// RXF7EIDH<RXF7EID14>
extern volatile __bit                   RXF7EID14           __at(0x7276);	// @ (0xE4E * 8 + 6)
#define                                 RXF7EID14_bit       _BIT_ACCESS(RXF7EIDH,6)
// RXF7EIDH<RXF7EID15>
extern volatile __bit                   RXF7EID15           __at(0x7277);	// @ (0xE4E * 8 + 7)
#define                                 RXF7EID15_bit       _BIT_ACCESS(RXF7EIDH,7)
// RXF7SIDL<RXF7EID16>
extern volatile __bit                   RXF7EID16           __at(0x7268);	// @ (0xE4D * 8 + 0)
#define                                 RXF7EID16_bit       _BIT_ACCESS(RXF7SIDL,0)
// RXF7SIDL<RXF7EID17>
extern volatile __bit                   RXF7EID17           __at(0x7269);	// @ (0xE4D * 8 + 1)
#define                                 RXF7EID17_bit       _BIT_ACCESS(RXF7SIDL,1)
// RXF7EIDL<RXF7EID2>
extern volatile __bit                   RXF7EID2            __at(0x727A);	// @ (0xE4F * 8 + 2)
#define                                 RXF7EID2_bit        _BIT_ACCESS(RXF7EIDL,2)
// RXF7EIDL<RXF7EID3>
extern volatile __bit                   RXF7EID3            __at(0x727B);	// @ (0xE4F * 8 + 3)
#define                                 RXF7EID3_bit        _BIT_ACCESS(RXF7EIDL,3)
// RXF7EIDL<RXF7EID4>
extern volatile __bit                   RXF7EID4            __at(0x727C);	// @ (0xE4F * 8 + 4)
#define                                 RXF7EID4_bit        _BIT_ACCESS(RXF7EIDL,4)
// RXF7EIDL<RXF7EID5>
extern volatile __bit                   RXF7EID5            __at(0x727D);	// @ (0xE4F * 8 + 5)
#define                                 RXF7EID5_bit        _BIT_ACCESS(RXF7EIDL,5)
// RXF7EIDL<RXF7EID6>
extern volatile __bit                   RXF7EID6            __at(0x727E);	// @ (0xE4F * 8 + 6)
#define                                 RXF7EID6_bit        _BIT_ACCESS(RXF7EIDL,6)
// RXF7EIDL<RXF7EID7>
extern volatile __bit                   RXF7EID7            __at(0x727F);	// @ (0xE4F * 8 + 7)
#define                                 RXF7EID7_bit        _BIT_ACCESS(RXF7EIDL,7)
// RXF7EIDH<RXF7EID8>
extern volatile __bit                   RXF7EID8            __at(0x7270);	// @ (0xE4E * 8 + 0)
#define                                 RXF7EID8_bit        _BIT_ACCESS(RXF7EIDH,0)
// RXF7EIDH<RXF7EID9>
extern volatile __bit                   RXF7EID9            __at(0x7271);	// @ (0xE4E * 8 + 1)
#define                                 RXF7EID9_bit        _BIT_ACCESS(RXF7EIDH,1)
// RXFCON0<RXF7EN>
extern volatile __bit                   RXF7EN              __at(0x7237);	// @ (0xE46 * 8 + 7)
#define                                 RXF7EN_bit          _BIT_ACCESS(RXFCON0,7)
// RXF7SIDL<RXF7EXIDEN>
extern volatile __bit                   RXF7EXIDEN          __at(0x726B);	// @ (0xE4D * 8 + 3)
#define                                 RXF7EXIDEN_bit      _BIT_ACCESS(RXF7SIDL,3)
// RXF7SIDL<RXF7SID0>
extern volatile __bit                   RXF7SID0            __at(0x726D);	// @ (0xE4D * 8 + 5)
#define                                 RXF7SID0_bit        _BIT_ACCESS(RXF7SIDL,5)
// RXF7SIDL<RXF7SID1>
extern volatile __bit                   RXF7SID1            __at(0x726E);	// @ (0xE4D * 8 + 6)
#define                                 RXF7SID1_bit        _BIT_ACCESS(RXF7SIDL,6)
// RXF7SIDH<RXF7SID10>
extern volatile __bit                   RXF7SID10           __at(0x7267);	// @ (0xE4C * 8 + 7)
#define                                 RXF7SID10_bit       _BIT_ACCESS(RXF7SIDH,7)
// RXF7SIDL<RXF7SID2>
extern volatile __bit                   RXF7SID2            __at(0x726F);	// @ (0xE4D * 8 + 7)
#define                                 RXF7SID2_bit        _BIT_ACCESS(RXF7SIDL,7)
// RXF7SIDH<RXF7SID3>
extern volatile __bit                   RXF7SID3            __at(0x7260);	// @ (0xE4C * 8 + 0)
#define                                 RXF7SID3_bit        _BIT_ACCESS(RXF7SIDH,0)
// RXF7SIDH<RXF7SID4>
extern volatile __bit                   RXF7SID4            __at(0x7261);	// @ (0xE4C * 8 + 1)
#define                                 RXF7SID4_bit        _BIT_ACCESS(RXF7SIDH,1)
// RXF7SIDH<RXF7SID5>
extern volatile __bit                   RXF7SID5            __at(0x7262);	// @ (0xE4C * 8 + 2)
#define                                 RXF7SID5_bit        _BIT_ACCESS(RXF7SIDH,2)
// RXF7SIDH<RXF7SID6>
extern volatile __bit                   RXF7SID6            __at(0x7263);	// @ (0xE4C * 8 + 3)
#define                                 RXF7SID6_bit        _BIT_ACCESS(RXF7SIDH,3)
// RXF7SIDH<RXF7SID7>
extern volatile __bit                   RXF7SID7            __at(0x7264);	// @ (0xE4C * 8 + 4)
#define                                 RXF7SID7_bit        _BIT_ACCESS(RXF7SIDH,4)
// RXF7SIDH<RXF7SID8>
extern volatile __bit                   RXF7SID8            __at(0x7265);	// @ (0xE4C * 8 + 5)
#define                                 RXF7SID8_bit        _BIT_ACCESS(RXF7SIDH,5)
// RXF7SIDH<RXF7SID9>
